{"id": "1_dog_affirmative", "i_sentence": "John owns a dog and it follows him everywhere he goes.", "s_sentence": "John owns a dog and it's not a big deal.", "type": "affirmative"}
{"id": "1_dog_negated", "i_sentence": "John doesn't own a dog and it follows him everywhere he goes.", "s_sentence": "John doesn't own a dog and it's not a big deal.", "type": "negated"}
{"id": "1_dog_know", "i_sentence": "I know that John owns a dog. It follows him everywhere he goes.", "s_sentence": "I know that John owns a dog. It's not a big deal.", "type": "know"}
{"id": "1_dog_doubt", "i_sentence": "I doubt that John owns a dog. It follows him everywhere he goes.", "s_sentence": "I doubt that John owns a dog. It's not a big deal.", "type": "doubt"}
{"id": "1_dog_modal", "i_sentence": "John wants to own a dog and it follows him everywhere he goes.", "s_sentence": "John wants to own a dog and it's not a big deal.", "type": "modal"}
{"id": "1_dog_managed", "i_sentence": "John managed to adopt a dog. It follows him everywhere he goes.", "s_sentence": "John managed to adopt a dog. It's not a big deal.", "type": "managed"}
{"id": "1_dog_failed", "i_sentence": "John failed to adopt a dog. It follows him everywhere he goes.", "s_sentence": "John failed to adopt a dog. It's not a big deal.", "type": "failed"}
{"id": "2_car_affirmative", "i_sentence": "Lucy has a car and it has a self-driving mode.", "s_sentence": "Lucy has a car and it's not a big deal.", "type": "affirmative"}
{"id": "2_car_negated", "i_sentence": "Lucy doesn't have a car and it has a self-driving mode.", "s_sentence": "Lucy doesn't have a car and it's not a big deal.", "type": "negated"}
{"id": "2_car_know", "i_sentence": "I know that Lucy has a car. It has a self-driving mode.", "s_sentence": "I know that Lucy has a car. It's not a big deal.", "type": "know"}
{"id": "2_car_doubt", "i_sentence": "I doubt that Lucy has a car. It has a self-driving mode.", "s_sentence": "I doubt that Lucy has a car. It's not a big deal.", "type": "doubt"}
{"id": "2_car_modal", "i_sentence": "Lucy wants to have a car and it has a self-driving mode.", "s_sentence": "Lucy wants to have a car and it's not a big deal.", "type": "modal"}
{"id": "2_car_managed", "i_sentence": "Lucy managed to rent a car. It has a self-driving mode.", "s_sentence": "Lucy managed to rent a car. It's not a big deal.", "type": "managed"}
{"id": "2_car_failed", "i_sentence": "Lucy failed to rent a car. It has a self-driving mode.", "s_sentence": "Lucy failed to rent a car. It's not a big deal.", "type": "failed"}
{"id": "3_bear_affirmative", "i_sentence": "Carol saw a bear at the zoo and it was taller than she expected.", "s_sentence": "Carol saw a bear at the zoo and it's not a big deal.", "type": "affirmative"}
{"id": "3_bear_negated", "i_sentence": "Carol didn't see a bear at the zoo and it was taller than she expected.", "s_sentence": "Carol didn't see a bear at the zoo and it's not a big deal.", "type": "negated"}
{"id": "3_bear_know", "i_sentence": "I know that Carol saw a bear at the zoo. It was taller than she expected.", "s_sentence": "I know that Carol saw a bear at the zoo. It's not a big deal.", "type": "know"}
{"id": "3_bear_doubt", "i_sentence": "I doubt that Carol saw a bear at the zoo. It was taller than she expected.", "s_sentence": "I doubt that Carol saw a bear at the zoo. It's not a big deal.", "type": "doubt"}
{"id": "3_bear_modal", "i_sentence": "Carol wants to see a bear at the zoo and it was taller than she expected.", "s_sentence": "Carol wants to see a bear at the zoo and it's not a big deal.", "type": "modal"}
{"id": "3_bear_managed", "i_sentence": "Carol managed to see a bear at the zoo. It was taller than she expected.", "s_sentence": "Carol managed to see a bear at the zoo. It's not a big deal.", "type": "managed"}
{"id": "3_bear_failed", "i_sentence": "Carol failed to see a bear at the zoo. It was taller than she expected.", "s_sentence": "Carol failed to see a bear at the zoo. It's not a big deal.", "type": "failed"}
{"id": "4_book_affirmative", "i_sentence": "Susan published a book and it is a real page-turner.", "s_sentence": "Susan published a book and it's not a big deal.", "type": "affirmative"}
{"id": "4_book_negated", "i_sentence": "Susan didn't publish a book and it is a real page-turner.", "s_sentence": "Susan didn't publish a book and it's not a big deal.", "type": "negated"}
{"id": "4_book_know", "i_sentence": "I know that Susan published a book. It is a real page-turner.", "s_sentence": "I know that Susan published a book. It's not a big deal.", "type": "know"}
{"id": "4_book_doubt", "i_sentence": "I doubt that Susan published a book. It is a real page-turner.", "s_sentence": "I doubt that Susan published a book. It's not a big deal.", "type": "doubt"}
{"id": "4_book_modal", "i_sentence": "Susan wants to publish a book and it is a real page-turner.", "s_sentence": "Susan wants to publish a book and it's not a big deal.", "type": "modal"}
{"id": "4_book_managed", "i_sentence": "Susan managed to write a book. It is a real page-turner.", "s_sentence": "Susan managed to write a book. It's not a big deal.", "type": "managed"}
{"id": "4_book_failed", "i_sentence": "Susan failed to write a book. It is a real page-turner.", "s_sentence": "Susan failed to write a book. It's not a big deal.", "type": "failed"}
{"id": "5_shirt_affirmative", "i_sentence": "Mary found a shirt at the store and it looks amazing on her.", "s_sentence": "Mary found a shirt at the store and it's not a big deal.", "type": "affirmative"}
{"id": "5_shirt_negated", "i_sentence": "Mary didn't find a shirt at the store and it looks amazing on her.", "s_sentence": "Mary didn't find a shirt at the store and it's not a big deal.", "type": "negated"}
{"id": "5_shirt_know", "i_sentence": "I know that Mary found a shirt at the store. It looks amazing on her.", "s_sentence": "I know that Mary found a shirt at the store. It's not a big deal.", "type": "know"}
{"id": "5_shirt_doubt", "i_sentence": "I doubt that Mary found a shirt at the store. It looks amazing on her.", "s_sentence": "I doubt that Mary found a shirt at the store. It's not a big deal.", "type": "doubt"}
{"id": "5_shirt_modal", "i_sentence": "Mary wants to find a shirt at the store and it looks amazing on her.", "s_sentence": "Mary wants to find a shirt at the store and it's not a big deal.", "type": "modal"}
{"id": "5_shirt_managed", "i_sentence": "Mary managed to find a shirt at the store. It looks amazing on her.", "s_sentence": "Mary managed to find a shirt at the store. It's not a big deal.", "type": "managed"}
{"id": "5_shirt_failed", "i_sentence": "Mary failed to find a shirt at the store. It looks amazing on her.", "s_sentence": "Mary failed to find a shirt at the store. It's not a big deal.", "type": "failed"}
{"id": "6_rat_affirmative", "i_sentence": "Carla got a pet rat and it is very noisy at night.", "s_sentence": "Carla got a pet rat and it's not a big deal.", "type": "affirmative"}
{"id": "6_rat_negated", "i_sentence": "Carla didn't get a pet rat and it is very noisy at night.", "s_sentence": "Carla didn't get a pet rat and it's not a big deal.", "type": "negated"}
{"id": "6_rat_know", "i_sentence": "I know that Carla got a pet rat. It is very noisy at night.", "s_sentence": "I know that Carla got a pet rat. It's not a big deal.", "type": "know"}
{"id": "6_rat_doubt", "i_sentence": "I doubt that Carla got a pet rat. It is very noisy at night.", "s_sentence": "I doubt that Carla got a pet rat. It's not a big deal.", "type": "doubt"}
{"id": "6_rat_modal", "i_sentence": "Carla wants to get a pet rat and it is very noisy at night.", "s_sentence": "Carla wants to get a pet rat and it's not a big deal.", "type": "modal"}
{"id": "6_rat_managed", "i_sentence": "Carla managed to get a pet rat. It is very noisy at night.", "s_sentence": "Carla managed to get a pet rat. It's not a big deal.", "type": "managed"}
{"id": "6_rat_failed", "i_sentence": "Carla failed to get a pet rat. It is very noisy at night.", "s_sentence": "Carla failed to get a pet rat. It's not a big deal.", "type": "failed"}
{"id": "7_beer_affirmative", "i_sentence": "Sam ordered a beer at the bar and it was warm.", "s_sentence": "Sam ordered a beer at the bar and it's not a big deal.", "type": "affirmative"}
{"id": "7_beer_negated", "i_sentence": "Sam didn't order a beer at the bar and it was warm.", "s_sentence": "Sam didn't order a beer at the bar and it's not a big deal.", "type": "negated"}
{"id": "7_beer_know", "i_sentence": "I know that Sam ordered a beer at the bar. It was warm.", "s_sentence": "I know that Sam ordered a beer at the bar. It's not a big deal.", "type": "know"}
{"id": "7_beer_doubt", "i_sentence": "I doubt that Sam ordered a beer at the bar. It was warm.", "s_sentence": "I doubt that Sam ordered a beer at the bar. It's not a big deal.", "type": "doubt"}
{"id": "7_beer_modal", "i_sentence": "Sam wants to order a beer at the bar and it was warm.", "s_sentence": "Sam wants to order a beer at the bar and it's not a big deal.", "type": "modal"}
{"id": "7_beer_managed", "i_sentence": "Sam managed to order a beer at the bar. It was warm.", "s_sentence": "Sam managed to order a beer at the bar. It's not a big deal.", "type": "managed"}
{"id": "7_beer_failed", "i_sentence": "Sam failed to order a beer at the bar. It was warm.", "s_sentence": "Sam failed to order a beer at the bar. It's not a big deal.", "type": "failed"}
{"id": "8_cake_affirmative", "i_sentence": "Michael baked a cake and it was the best thing at the picnic.", "s_sentence": "Michael baked a cake and it's not a big deal.", "type": "affirmative"}
{"id": "8_cake_negated", "i_sentence": "Michael didn't bake a cake and it was the best thing at the picnic.", "s_sentence": "Michael didn't bake a cake and it's not a big deal.", "type": "negated"}
{"id": "8_cake_know", "i_sentence": "I know that Michael baked a cake. It was the best thing at the picnic.", "s_sentence": "I know that Michael baked a cake. It's not a big deal.", "type": "know"}
{"id": "8_cake_doubt", "i_sentence": "I doubt that Michael baked a cake. It was the best thing at the picnic.", "s_sentence": "I doubt that Michael baked a cake. It's not a big deal.", "type": "doubt"}
{"id": "8_cake_modal", "i_sentence": "Michael wants to bake a cake and it was the best thing at the picnic.", "s_sentence": "Michael wants to bake a cake and it's not a big deal.", "type": "modal"}
{"id": "8_cake_managed", "i_sentence": "Michael managed to bake a cake. It was the best thing at the picnic.", "s_sentence": "Michael managed to bake a cake. It's not a big deal.", "type": "managed"}
{"id": "8_cake_failed", "i_sentence": "Michael failed to bake a cake. It was the best thing at the picnic.", "s_sentence": "Michael failed to bake a cake. It's not a big deal.", "type": "failed"}
{"id": "9_letter_affirmative", "i_sentence": "Carolyn wrote a letter to her parents and it arrived three days after she sent it.", "s_sentence": "Carolyn wrote a letter to her parents and it's not a big deal.", "type": "affirmative"}
{"id": "9_letter_negated", "i_sentence": "Carolyn didn't write a letter to her parents and it arrived three days after she sent it.", "s_sentence": "Carolyn didn't write a letter to her parents and it's not a big deal.", "type": "negated"}
{"id": "9_letter_know", "i_sentence": "I know that Carolyn wrote a letter to her parents. It arrived three days after she sent it.", "s_sentence": "I know that Carolyn wrote a letter to her parents. It's not a big deal.", "type": "know"}
{"id": "9_letter_doubt", "i_sentence": "I doubt that Carolyn wrote a letter to her parents. It arrived three days after she sent it.", "s_sentence": "I doubt that Carolyn wrote a letter to her parents. It's not a big deal.", "type": "doubt"}
{"id": "9_letter_modal", "i_sentence": "Carolyn wants to write a letter to her parents and it arrived three days after she sent it.", "s_sentence": "Carolyn wants to write a letter to her parents and it's not a big deal.", "type": "modal"}
{"id": "9_letter_managed", "i_sentence": "Carolyn managed to write a letter to her parents. It arrived three days after she sent it.", "s_sentence": "Carolyn managed to write a letter to her parents. It's not a big deal.", "type": "managed"}
{"id": "9_letter_failed", "i_sentence": "Carolyn failed to write a letter to her parents. It arrived three days after she sent it.", "s_sentence": "Carolyn failed to write a letter to her parents. It's not a big deal.", "type": "failed"}
{"id": "10_hat_affirmative", "i_sentence": "Chris knitted a hat and it was very colorful.", "s_sentence": "Chris knitted a hat and it's not a big deal.", "type": "affirmative"}
{"id": "10_hat_negated", "i_sentence": "Chris didn't knit a hat and it was very colorful.", "s_sentence": "Chris didn't knit a hat and it's not a big deal.", "type": "negated"}
{"id": "10_hat_know", "i_sentence": "I know that Chris knitted a hat. It was very colorful.", "s_sentence": "I know that Chris knitted a hat. It's not a big deal.", "type": "know"}
{"id": "10_hat_doubt", "i_sentence": "I doubt that Chris knitted a hat. It was very colorful.", "s_sentence": "I doubt that Chris knitted a hat. It's not a big deal.", "type": "doubt"}
{"id": "10_hat_modal", "i_sentence": "Chris wants to knit a hat and it was very colorful.", "s_sentence": "Chris wants to knit a hat and it's not a big deal.", "type": "modal"}
{"id": "10_hat_managed", "i_sentence": "Chris managed to knit a hat. It was very colorful.", "s_sentence": "Chris managed to knit a hat. It's not a big deal.", "type": "managed"}
{"id": "10_hat_failed", "i_sentence": "Chris failed to knit a hat. It was very colorful.", "s_sentence": "Chris failed to knit a hat. It's not a big deal.", "type": "failed"}
{"id": "11_cod_affirmative", "i_sentence": "Sarah caught a cod and it made a fantastic dinner.", "s_sentence": "Sarah caught a cod and it's not a big deal.", "type": "affirmative"}
{"id": "11_cod_negated", "i_sentence": "Sarah didn't catch a cod and it made a fantastic dinner.", "s_sentence": "Sarah didn't catch a cod and it's not a big deal.", "type": "negated"}
{"id": "11_cod_know", "i_sentence": "I know that Sarah caught a cod. It made a fantastic dinner.", "s_sentence": "I know that Sarah caught a cod. It's not a big deal.", "type": "know"}
{"id": "11_cod_doubt", "i_sentence": "I doubt that Sarah caught a cod. It made a fantastic dinner.", "s_sentence": "I doubt that Sarah caught a cod. It's not a big deal.", "type": "doubt"}
{"id": "11_cod_modal", "i_sentence": "Sarah wants to catch a cod and it made a fantastic dinner.", "s_sentence": "Sarah wants to catch a cod and it's not a big deal.", "type": "modal"}
{"id": "11_cod_managed", "i_sentence": "Sarah managed to catch a cod. It made a fantastic dinner.", "s_sentence": "Sarah managed to catch a cod. It's not a big deal.", "type": "managed"}
{"id": "11_cod_failed", "i_sentence": "Sarah failed to catch a cod. It made a fantastic dinner.", "s_sentence": "Sarah failed to catch a cod. It's not a big deal.", "type": "failed"}
{"id": "12_ticket_affirmative", "i_sentence": "Thomas booked a ticket in advance and it was much cheaper than he expected.", "s_sentence": "Thomas booked a ticket in advance and it's not a big deal.", "type": "affirmative"}
{"id": "12_ticket_negated", "i_sentence": "Thomas didn't book a ticket in advance and it was much cheaper than he expected.", "s_sentence": "Thomas didn't book a ticket in advance and it's not a big deal.", "type": "negated"}
{"id": "12_ticket_know", "i_sentence": "I know that Thomas booked a ticket in advance. It was much cheaper than he expected.", "s_sentence": "I know that Thomas booked a ticket in advance. It's not a big deal.", "type": "know"}
{"id": "12_ticket_doubt", "i_sentence": "I doubt that Thomas booked a ticket in advance. It was much cheaper than he expected.", "s_sentence": "I doubt that Thomas booked a ticket in advance. It's not a big deal.", "type": "doubt"}
{"id": "12_ticket_modal", "i_sentence": "Thomas wants to book a ticket in advance and it was much cheaper than he expected.", "s_sentence": "Thomas wants to book a ticket in advance and it's not a big deal.", "type": "modal"}
{"id": "12_ticket_managed", "i_sentence": "Thomas managed to book a ticket. It was much cheaper than he expected.", "s_sentence": "Thomas managed to book a ticket. It's not a big deal.", "type": "managed"}
{"id": "12_ticket_failed", "i_sentence": "Thomas failed to book a ticket. It was much cheaper than he expected.", "s_sentence": "Thomas failed to book a ticket. It's not a big deal.", "type": "failed"}
{"id": "13_bed_affirmative", "i_sentence": "Luke bought a bed and it was delivered the next day.", "s_sentence": "Luke bought a bed and it's not a big deal.", "type": "affirmative"}
{"id": "13_bed_negated", "i_sentence": "Luke didn't buy a bed and it was delivered the next day.", "s_sentence": "Luke didn't buy a bed and it's not a big deal.", "type": "negated"}
{"id": "13_bed_know", "i_sentence": "I know that Luke bought a bed. It was delivered the next day.", "s_sentence": "I know that Luke bought a bed. It's not a big deal.", "type": "know"}
{"id": "13_bed_doubt", "i_sentence": "I doubt that Luke bought a bed. It was delivered the next day.", "s_sentence": "I doubt that Luke bought a bed. It's not a big deal.", "type": "doubt"}
{"id": "13_bed_modal", "i_sentence": "Luke wants to buy a bed and it was delivered the next day.", "s_sentence": "Luke wants to buy a bed and it's not a big deal.", "type": "modal"}
{"id": "13_bed_managed", "i_sentence": "Luke managed to buy a bed. It was delivered the next day.", "s_sentence": "Luke managed to buy a bed. It's not a big deal.", "type": "managed"}
{"id": "13_bed_failed", "i_sentence": "Luke failed to buy a bed. It was delivered the next day.", "s_sentence": "Luke failed to buy a bed. It's not a big deal.", "type": "failed"}
{"id": "14_gin_affirmative", "i_sentence": "Dan drank a gin tonic and it was very strong.", "s_sentence": "Dan drank a gin tonic and it's not a big deal.", "type": "affirmative"}
{"id": "14_gin_negated", "i_sentence": "Dan didn't drink a gin tonic and it was very strong.", "s_sentence": "Dan didn't drink a gin tonic and it's not a big deal.", "type": "negated"}
{"id": "14_gin_know", "i_sentence": "I know that Dan drank a gin tonic. It was very strong.", "s_sentence": "I know that Dan drank a gin tonic. It's not a big deal.", "type": "know"}
{"id": "14_gin_doubt", "i_sentence": "I doubt that Dan drank a gin tonic. It was very strong.", "s_sentence": "I doubt that Dan drank a gin tonic. It's not a big deal.", "type": "doubt"}
{"id": "14_gin_modal", "i_sentence": "Dan wants to drink a gin tonic and it was very strong.", "s_sentence": "Dan wants to drink a gin tonic and it's not a big deal.", "type": "modal"}
{"id": "14_gin_managed", "i_sentence": "Dan managed to mix a gin tonic. It was very strong.", "s_sentence": "Dan managed to mix a gin tonic. It's not a big deal.", "type": "managed"}
{"id": "14_gin_failed", "i_sentence": "Dan failed to mix a gin tonic. It was very strong.", "s_sentence": "Dan failed to mix a gin tonic. It's not a big deal.", "type": "failed"}
{"id": "15_bone_affirmative", "i_sentence": "David discovered a bone on his archeological expedition and it likely belonged to an extinct bird species.", "s_sentence": "David discovered a bone on his archeological expedition and it's not a big deal.", "type": "affirmative"}
{"id": "15_bone_negated", "i_sentence": "David didn't discover a bone on his archeological expedition and it likely belonged to an extinct bird species.", "s_sentence": "David didn't discover a bone on his archeological expedition and it's not a big deal.", "type": "negated"}
{"id": "15_bone_know", "i_sentence": "I know that David discovered a bone on his archeological expedition. It likely belonged to an extinct bird species.", "s_sentence": "I know that David discovered a bone on his archeological expedition. It's not a big deal.", "type": "know"}
{"id": "15_bone_doubt", "i_sentence": "I doubt that David discovered a bone on his archeological expedition. It likely belonged to an extinct bird species.", "s_sentence": "I doubt that David discovered a bone on his archeological expedition. It's not a big deal.", "type": "doubt"}
{"id": "15_bone_modal", "i_sentence": "David wants to discover a bone on his archeological expedition and it likely belonged to an extinct bird species.", "s_sentence": "David wants to discover a bone on his archeological expedition and it's not a big deal.", "type": "modal"}
{"id": "15_bone_managed", "i_sentence": "David managed to discover a bone on his archeological expedition. It likely belonged to an extinct bird species.", "s_sentence": "David managed to discover a bone on his archeological expedition. It's not a big deal.", "type": "managed"}
{"id": "15_bone_failed", "i_sentence": "David failed to discover a bone on his archeological expedition. It likely belonged to an extinct bird species.", "s_sentence": "David failed to discover a bone on his archeological expedition. It's not a big deal.", "type": "failed"}
{"id": "16_house_affirmative", "i_sentence": "Lisa built a house and it is the most beautiful building I have ever seen.", "s_sentence": "Lisa built a house and it's not a big deal.", "type": "affirmative"}
{"id": "16_house_negated", "i_sentence": "Lisa didn't build a house and it is the most beautiful building I have ever seen.", "s_sentence": "Lisa didn't build a house and it's not a big deal.", "type": "negated"}
{"id": "16_house_know", "i_sentence": "I know that Lisa built a house. It is the most beautiful building I have ever seen.", "s_sentence": "I know that Lisa built a house. It's not a big deal.", "type": "know"}
{"id": "16_house_doubt", "i_sentence": "I doubt that Lisa built a house. It is the most beautiful building I have ever seen.", "s_sentence": "I doubt that Lisa built a house. It's not a big deal.", "type": "doubt"}
{"id": "16_house_modal", "i_sentence": "Lisa wants to build a house and it is the most beautiful building I have ever seen.", "s_sentence": "Lisa wants to build a house and it's not a big deal.", "type": "modal"}
{"id": "16_house_managed", "i_sentence": "Lisa managed to build a house. It is the most beautiful building I have ever seen.", "s_sentence": "Lisa managed to build a house. It's not a big deal.", "type": "managed"}
{"id": "16_house_failed", "i_sentence": "Lisa failed to build a house. It is the most beautiful building I have ever seen.", "s_sentence": "Lisa failed to build a house. It's not a big deal.", "type": "failed"}
