{"id": "1_dog_affirmative_negation", "exp_sentence": "John owns a dog but he doesn't own a cat. The dog", "unexp_sentence": "John owns a dog but he doesn't own a cat. The cat", "type": "affirmative_negation", "order": 1}
{"id": "1_dog_affirmative_negation", "exp_sentence": "John owns a cat but he doesn't own a dog. The cat", "unexp_sentence": "John owns a cat but he doesn't own a dog. The dog", "type": "affirmative_negation", "order": 2}
{"id": "1_dog_negation_affirmative", "exp_sentence": "John doesn't own a dog but he owns a cat. The cat", "unexp_sentence": "John doesn't own a dog but he owns a cat. The dog", "type": "negation_affirmative", "order": 1}
{"id": "1_dog_negation_affirmative", "exp_sentence": "John doesn't own a cat but he owns a dog. The dog", "unexp_sentence": "John doesn't own a cat but he owns a dog. The cat", "type": "negation_affirmative", "order": 2}
{"id": "1_dog_know_doubt", "exp_sentence": "I know that John owns a dog but I doubt that he owns a cat. The dog", "unexp_sentence": "I know that John owns a dog but I doubt that he owns a cat. The cat", "type": "know_doubt", "order": 1}
{"id": "1_dog_know_doubt", "exp_sentence": "I know that John owns a cat but I doubt that he owns a dog. The cat", "unexp_sentence": "I know that John owns a cat but I doubt that he owns a dog. The dog", "type": "know_doubt", "order": 2}
{"id": "1_dog_doubt_know", "exp_sentence": "I doubt that John owns a dog but I know that he owns a cat. The cat", "unexp_sentence": "I doubt that John owns a dog but I know that he owns a cat. The dog", "type": "doubt_know", "order": 1}
{"id": "1_dog_doubt_know", "exp_sentence": "I doubt that John owns a cat but I know that he owns a dog. The dog", "unexp_sentence": "I doubt that John owns a cat but I know that he owns a dog. The cat", "type": "doubt_know", "order": 2}
{"id": "1_dog_affirmative_modal", "exp_sentence": "John owns a dog but he wants to own a cat. The dog", "unexp_sentence": "John owns a dog but he wants to own a cat. The cat", "type": "affirmative_modal", "order": 1}
{"id": "1_dog_affirmative_modal", "exp_sentence": "John owns a cat but he wants to own a dog. The cat", "unexp_sentence": "John owns a cat but he wants to own a dog. The dog", "type": "affirmative_modal", "order": 2}
{"id": "1_dog_modal_affirmative", "exp_sentence": "John wants to own a dog but he owns a cat. The cat", "unexp_sentence": "John wants to own a dog but he owns a cat. The dog", "type": "modal_affirmative", "order": 1}
{"id": "1_dog_modal_affirmative", "exp_sentence": "John wants to own a cat but he owns a dog. The dog", "unexp_sentence": "John wants to own a cat but he owns a dog. The cat", "type": "modal_affirmative", "order": 2}
{"id": "1_dog_managed_failed", "exp_sentence": "John managed to adopt a dog but failed to adopt a cat. The dog", "unexp_sentence": "John managed to adopt a dog but failed to adopt a cat. The cat", "type": "managed_failed", "order": 1}
{"id": "1_dog_managed_failed", "exp_sentence": "John managed to adopt a cat but failed to adopt a dog. The cat", "unexp_sentence": "John managed to adopt a cat but failed to adopt a dog. The dog", "type": "managed_failed", "order": 2}
{"id": "1_dog_failed_managed", "exp_sentence": "John failed to adopt a dog but managed to adopt a cat. The cat", "unexp_sentence": "John failed to adopt a dog but managed to adopt a cat. The dog", "type": "failed_managed", "order": 1}
{"id": "1_dog_failed_managed", "exp_sentence": "John failed to adopt a cat but managed to adopt a dog. The dog", "unexp_sentence": "John failed to adopt a cat but managed to adopt a dog. The cat", "type": "failed_managed", "order": 2}
{"id": "2_car_affirmative_negation", "exp_sentence": "Peter has a car but he doesn't have a bike. The car", "unexp_sentence": "Peter has a car but he doesn't have a bike. The bike", "type": "affirmative_negation", "order": 1}
{"id": "2_car_affirmative_negation", "exp_sentence": "Peter has a bike but he doesn't have a car. The bike", "unexp_sentence": "Peter has a bike but he doesn't have a car. The car", "type": "affirmative_negation", "order": 2}
{"id": "2_car_negation_affirmative", "exp_sentence": "Peter doesn't have a car but he has a bike. The bike", "unexp_sentence": "Peter doesn't have a car but he has a bike. The car", "type": "negation_affirmative", "order": 1}
{"id": "2_car_negation_affirmative", "exp_sentence": "Peter doesn't have a bike but he has a car. The car", "unexp_sentence": "Peter doesn't have a bike but he has a car. The bike", "type": "negation_affirmative", "order": 2}
{"id": "2_car_know_doubt", "exp_sentence": "I know that Lucy has a car but I doubt that she has a bike. The car", "unexp_sentence": "I know that Lucy has a car but I doubt that she has a bike. The bike", "type": "know_doubt", "order": 1}
{"id": "2_car_know_doubt", "exp_sentence": "I know that Lucy has a bike but I doubt that she has a car. The bike", "unexp_sentence": "I know that Lucy has a bike but I doubt that she has a car. The car", "type": "know_doubt", "order": 2}
{"id": "2_car_doubt_know", "exp_sentence": "I doubt that Lucy has a car but I know that she has a bike. The bike", "unexp_sentence": "I doubt that Lucy has a car but I know that she has a bike. The car", "type": "doubt_know", "order": 1}
{"id": "2_car_doubt_know", "exp_sentence": "I doubt that Lucy has a bike but I know that she has a car. The car", "unexp_sentence": "I doubt that Lucy has a bike but I know that she has a car. The bike", "type": "doubt_know", "order": 2}
{"id": "2_car_affirmative_modal", "exp_sentence": "Peter has a car but he wants to have a bike. The car", "unexp_sentence": "Peter has a car but he wants to have a bike. The bike", "type": "affirmative_modal", "order": 1}
{"id": "2_car_affirmative_modal", "exp_sentence": "Peter has a bike but he wants to have a car. The bike", "unexp_sentence": "Peter has a bike but he wants to have a car. The car", "type": "affirmative_modal", "order": 2}
{"id": "2_car_modal_affirmative", "exp_sentence": "Peter wants to have a car but he has a bike. The bike", "unexp_sentence": "Peter wants to have a car but he has a bike. The car", "type": "modal_affirmative", "order": 1}
{"id": "2_car_modal_affirmative", "exp_sentence": "Peter wants to have a bike but he has a car. The car", "unexp_sentence": "Peter wants to have a bike but he has a car. The bike", "type": "modal_affirmative", "order": 2}
{"id": "2_car_managed_failed", "exp_sentence": "Lucy managed to rent a car but she failed to rent a bike. The car", "unexp_sentence": "Lucy managed to rent a car but she failed to rent a bike. The bike", "type": "managed_failed", "order": 1}
{"id": "2_car_managed_failed", "exp_sentence": "Lucy managed to rent a bike but she failed to rent a car. The bike", "unexp_sentence": "Lucy managed to rent a bike but she failed to rent a car. The car", "type": "managed_failed", "order": 2}
{"id": "2_car_failed_managed", "exp_sentence": "Lucy failed to rent a car but she managed to rent a bike. The bike", "unexp_sentence": "Lucy failed to rent a car but she managed to rent a bike. The car", "type": "failed_managed", "order": 1}
{"id": "2_car_failed_managed", "exp_sentence": "Lucy failed to rent a bike but she managed to rent a car. The car", "unexp_sentence": "Lucy failed to rent a bike but she managed to rent a car. The bike", "type": "failed_managed", "order": 2}
{"id": "3_bear_affirmative_negation", "exp_sentence": "Carol saw a bear at the zoo but she didn't see a monkey. The bear", "unexp_sentence": "Carol saw a bear at the zoo but she didn't see a monkey. The monkey", "type": "affirmative_negation", "order": 1}
{"id": "3_bear_affirmative_negation", "exp_sentence": "Carol saw a monkey at the zoo but she didn't see a bear. The monkey", "unexp_sentence": "Carol saw a monkey at the zoo but she didn't see a bear. The bear", "type": "affirmative_negation", "order": 2}
{"id": "3_bear_negation_affirmative", "exp_sentence": "Carol didn't see a bear at the zoo but she saw a monkey. The monkey", "unexp_sentence": "Carol didn't see a bear at the zoo but she saw a monkey. The bear", "type": "negation_affirmative", "order": 1}
{"id": "3_bear_negation_affirmative", "exp_sentence": "Carol didn't see a monkey at the zoo but she saw a bear. The bear", "unexp_sentence": "Carol didn't see a monkey at the zoo but she saw a bear. The monkey", "type": "negation_affirmative", "order": 2}
{"id": "3_bear_know_doubt", "exp_sentence": "I know that Carol saw a bear at the zoo but I doubt that she saw a monkey. The bear", "unexp_sentence": "I know that Carol saw a bear at the zoo but I doubt that she saw a monkey. The monkey", "type": "know_doubt", "order": 1}
{"id": "3_bear_know_doubt", "exp_sentence": "I know that Carol saw a monkey at the zoo but I doubt that she saw a bear. The monkey", "unexp_sentence": "I know that Carol saw a monkey at the zoo but I doubt that she saw a bear. The bear", "type": "know_doubt", "order": 2}
{"id": "3_bear_doubt_know", "exp_sentence": "I doubt that Carol saw a bear at the zoo but I know that she saw a monkey. The monkey", "unexp_sentence": "I doubt that Carol saw a bear at the zoo but I know that she saw a monkey. The bear", "type": "doubt_know", "order": 1}
{"id": "3_bear_doubt_know", "exp_sentence": "I doubt that Carol saw a monkey at the zoo but I know that she saw a bear. The bear", "unexp_sentence": "I doubt that Carol saw a monkey at the zoo but I know that she saw a bear. The monkey", "type": "doubt_know", "order": 2}
{"id": "3_bear_affirmative_modal", "exp_sentence": "Carol saw a bear at the zoo but she wanted to see a monkey. The bear", "unexp_sentence": "Carol saw a bear at the zoo but she wanted to see a monkey. The monkey", "type": "affirmative_modal", "order": 1}
{"id": "3_bear_affirmative_modal", "exp_sentence": "Carol saw a monkey at the zoo but she wanted to see a bear. The monkey", "unexp_sentence": "Carol saw a monkey at the zoo but she wanted to see a bear. The bear", "type": "affirmative_modal", "order": 2}
{"id": "3_bear_modal_affirmative", "exp_sentence": "Carol wanted to see a bear at the zoo but she saw a monkey. The monkey", "unexp_sentence": "Carol wanted to see a bear at the zoo but she saw a monkey. The bear", "type": "modal_affirmative", "order": 1}
{"id": "3_bear_modal_affirmative", "exp_sentence": "Carol wanted to see a monkey at the zoo but she saw a bear. The bear", "unexp_sentence": "Carol wanted to see a monkey at the zoo but she saw a bear. The monkey", "type": "modal_affirmative", "order": 2}
{"id": "3_bear_managed_failed", "exp_sentence": "Carol managed to see a bear at the zoo but failed to see a monkey. The bear", "unexp_sentence": "Carol managed to see a bear at the zoo but failed to see a monkey. The monkey", "type": "managed_failed", "order": 1}
{"id": "3_bear_managed_failed", "exp_sentence": "Carol managed to see a monkey at the zoo but failed to see a bear. The monkey", "unexp_sentence": "Carol managed to see a monkey at the zoo but failed to see a bear. The bear", "type": "managed_failed", "order": 2}
{"id": "3_bear_failed_managed", "exp_sentence": "Carol failed to see a bear at the zoo but managed to see a monkey. The monkey", "unexp_sentence": "Carol failed to see a bear at the zoo but managed to see a monkey. The bear", "type": "failed_managed", "order": 1}
{"id": "3_bear_failed_managed", "exp_sentence": "Carol failed to see a monkey at the zoo but managed to see a bear. The bear", "unexp_sentence": "Carol failed to see a monkey at the zoo but managed to see a bear. The monkey", "type": "failed_managed", "order": 2}
{"id": "4_book_affirmative_negation", "exp_sentence": "Susan published a book but she didn't publish an article in the New Yorker. The book", "unexp_sentence": "Susan published a book but she didn't publish an article in the New Yorker. The article", "type": "affirmative_negation", "order": 1}
{"id": "4_book_affirmative_negation", "exp_sentence": "Susan published an article in the New Yorker but she didn't publish a book. The article", "unexp_sentence": "Susan published an article in the New Yorker but she didn't publish a book. The book", "type": "affirmative_negation", "order": 2}
{"id": "4_book_negation_affirmative", "exp_sentence": "Susan didn't publish a book but she published an article in the New Yorker. The article", "unexp_sentence": "Susan didn't publish a book but she published an article in the New Yorker. The book", "type": "negation_affirmative", "order": 1}
{"id": "4_book_negation_affirmative", "exp_sentence": "Susan didn't publish an article in the New Yorker but she published a book. The book", "unexp_sentence": "Susan didn't publish an article in the New Yorker but she published a book. The article", "type": "negation_affirmative", "order": 2}
{"id": "4_book_know_doubt", "exp_sentence": "I know that Susan published a book but I doubt that she published an article in the New Yorker. The book", "unexp_sentence": "I know that Susan published a book but I doubt that she published an article in the New Yorker. The article", "type": "know_doubt", "order": 1}
{"id": "4_book_know_doubt", "exp_sentence": "I know that Susan published an article in the New Yorker but I doubt that she published a book. The article", "unexp_sentence": "I know that Susan published an article in the New Yorker but I doubt that she published a book. The book", "type": "know_doubt", "order": 2}
{"id": "4_book_doubt_know", "exp_sentence": "I doubt that Susan published a book but I know that she published an article in the New Yorker. The article", "unexp_sentence": "I doubt that Susan published a book but I know that she published an article in the New Yorker. The book", "type": "doubt_know", "order": 1}
{"id": "4_book_doubt_know", "exp_sentence": "I doubt that Susan published an article in the New Yorker but I know that she published  a book. The book", "unexp_sentence": "I doubt that Susan published an article in the New Yorker but I know that she published  a book. The article", "type": "doubt_know", "order": 2}
{"id": "4_book_affirmative_modal", "exp_sentence": "Susan published a book but she wanted to publish an article in the New Yorker. The book", "unexp_sentence": "Susan published a book but she wanted to publish an article in the New Yorker. The article", "type": "affirmative_modal", "order": 1}
{"id": "4_book_affirmative_modal", "exp_sentence": "Susan published an article in the New Yorker but she wanted to publish a book. The article", "unexp_sentence": "Susan published an article in the New Yorker but she wanted to publish a book. The book", "type": "affirmative_modal", "order": 2}
{"id": "4_book_modal_affirmative", "exp_sentence": "Susan wanted to publish a book but she published an article in the New Yorker. The article", "unexp_sentence": "Susan wanted to publish a book but she published an article in the New Yorker. The book", "type": "modal_affirmative", "order": 1}
{"id": "4_book_modal_affirmative", "exp_sentence": "Susan wanted to publish an article in the New Yorker but she published a book. The book", "unexp_sentence": "Susan wanted to publish an article in the New Yorker but she published a book. The article", "type": "modal_affirmative", "order": 2}
{"id": "4_book_managed_failed", "exp_sentence": "Susan managed to write a book but failed to write an article for the New Yorker. The book", "unexp_sentence": "Susan managed to write a book but failed to write an article for the New Yorker. The article", "type": "managed_failed", "order": 1}
{"id": "4_book_managed_failed", "exp_sentence": "Susan managed to write an article for the New Yorker but failed to write a book. The article", "unexp_sentence": "Susan managed to write an article for the New Yorker but failed to write a book. The book", "type": "managed_failed", "order": 2}
{"id": "4_book_failed_managed", "exp_sentence": "Susan failed to write a book but managed to write an article for the New Yorker. The article", "unexp_sentence": "Susan failed to write a book but managed to write an article for the New Yorker. The book", "type": "failed_managed", "order": 1}
{"id": "4_book_failed_managed", "exp_sentence": "Susan failed to write an article for the New Yorker but managed to write a book. The book", "unexp_sentence": "Susan failed to write an article for the New Yorker but managed to write a book. The article", "type": "failed_managed", "order": 2}
{"id": "5_shirt_affirmative_negation", "exp_sentence": "Mary found a shirt at the store but she didn't find a hat. The shirt", "unexp_sentence": "Mary found a shirt at the store but she didn't find a hat. The hat", "type": "affirmative_negation", "order": 1}
{"id": "5_shirt_affirmative_negation", "exp_sentence": "Mary found a hat at the store but she didn't find a shirt. The hat", "unexp_sentence": "Mary found a hat at the store but she didn't find a shirt. The shirt", "type": "affirmative_negation", "order": 2}
{"id": "5_shirt_negation_affirmative", "exp_sentence": "Mary didn't find a shirt at the store but she found a hat. The hat", "unexp_sentence": "Mary didn't find a shirt at the store but she found a hat. The shirt", "type": "negation_affirmative", "order": 1}
{"id": "5_shirt_negation_affirmative", "exp_sentence": "Mary didn't find a hat at the store but she found a shirt. The shirt", "unexp_sentence": "Mary didn't find a hat at the store but she found a shirt. The hat", "type": "negation_affirmative", "order": 2}
{"id": "5_shirt_know_doubt", "exp_sentence": "I know that Mary found a shirt at the store but I doubt that she found a hat. The shirt", "unexp_sentence": "I know that Mary found a shirt at the store but I doubt that she found a hat. The hat", "type": "know_doubt", "order": 1}
{"id": "5_shirt_know_doubt", "exp_sentence": "I know that Mary found a hat at the store but I doubt that she found a shirt. The hat", "unexp_sentence": "I know that Mary found a hat at the store but I doubt that she found a shirt. The shirt", "type": "know_doubt", "order": 2}
{"id": "5_shirt_doubt_know", "exp_sentence": "I doubt that Mary found a shirt at the store but I know that she found a hat. The hat", "unexp_sentence": "I doubt that Mary found a shirt at the store but I know that she found a hat. The shirt", "type": "doubt_know", "order": 1}
{"id": "5_shirt_doubt_know", "exp_sentence": "I doubt that Mary found a hat at the store but I know that she found a shirt. The shirt", "unexp_sentence": "I doubt that Mary found a hat at the store but I know that she found a shirt. The hat", "type": "doubt_know", "order": 2}
{"id": "5_shirt_affirmative_modal", "exp_sentence": "Mary found a shirt at the store but she wanted to find a hat. The shirt", "unexp_sentence": "Mary found a shirt at the store but she wanted to find a hat. The hat", "type": "affirmative_modal", "order": 1}
{"id": "5_shirt_affirmative_modal", "exp_sentence": "Mary found a hat at the store but she wanted to find a shirt. The hat", "unexp_sentence": "Mary found a hat at the store but she wanted to find a shirt. The shirt", "type": "affirmative_modal", "order": 2}
{"id": "5_shirt_modal_affirmative", "exp_sentence": "Mary wanted to find a shirt at the store but she found a hat. The hat", "unexp_sentence": "Mary wanted to find a shirt at the store but she found a hat. The shirt", "type": "modal_affirmative", "order": 1}
{"id": "5_shirt_modal_affirmative", "exp_sentence": "Mary wanted to find a hat at the store but she found a shirt. The shirt", "unexp_sentence": "Mary wanted to find a hat at the store but she found a shirt. The hat", "type": "modal_affirmative", "order": 2}
{"id": "5_shirt_managed_failed", "exp_sentence": "Mary managed to find a shirt at the store but failed to find a hat. The shirt", "unexp_sentence": "Mary managed to find a shirt at the store but failed to find a hat. The hat", "type": "managed_failed", "order": 1}
{"id": "5_shirt_managed_failed", "exp_sentence": "Mary managed to find a hat at the store but failed to find a shirt. The hat", "unexp_sentence": "Mary managed to find a hat at the store but failed to find a shirt. The shirt", "type": "managed_failed", "order": 2}
{"id": "5_shirt_failed_managed", "exp_sentence": "Mary failed to find a shirt at the store but managed to find a hat. The hat", "unexp_sentence": "Mary failed to find a shirt at the store but managed to find a hat. The shirt", "type": "failed_managed", "order": 1}
{"id": "5_shirt_failed_managed", "exp_sentence": "Mary failed to find a hat at the store but managed to find a shirt. The shirt", "unexp_sentence": "Mary failed to find a hat at the store but managed to find a shirt. The hat", "type": "failed_managed", "order": 2}
{"id": "6_rat_affirmative_negation", "exp_sentence": "Carla got a pet rat but she didn't get a bird. The rat", "unexp_sentence": "Carla got a pet rat but she didn't get a bird. The bird", "type": "affirmative_negation", "order": 1}
{"id": "6_rat_affirmative_negation", "exp_sentence": "Carla got a bird but she didn't get a pet rat. The bird", "unexp_sentence": "Carla got a bird but she didn't get a pet rat. The rat", "type": "affirmative_negation", "order": 2}
{"id": "6_rat_negation_affirmative", "exp_sentence": "Carla didn't get a pet rat but she got a bird. The bird", "unexp_sentence": "Carla didn't get a pet rat but she got a bird. The rat", "type": "negation_affirmative", "order": 1}
{"id": "6_rat_negation_affirmative", "exp_sentence": "Carla didn't get a bird but she got a pet rat. The rat", "unexp_sentence": "Carla didn't get a bird but she got a pet rat. The bird", "type": "negation_affirmative", "order": 2}
{"id": "6_rat_know_doubt", "exp_sentence": "I know that Carla got a pet rat but I doubt she got a bird. The rat", "unexp_sentence": "I know that Carla got a pet rat but I doubt she got a bird. The bird", "type": "know_doubt", "order": 1}
{"id": "6_rat_know_doubt", "exp_sentence": "I know that Carla got a bird but I doubt she got a pet rat. The bird", "unexp_sentence": "I know that Carla got a bird but I doubt she got a pet rat. The rat", "type": "know_doubt", "order": 2}
{"id": "6_rat_doubt_know", "exp_sentence": "I doubt that Carla got a pet rat but I know she got a bird. The bird", "unexp_sentence": "I doubt that Carla got a pet rat but I know she got a bird. The rat", "type": "doubt_know", "order": 1}
{"id": "6_rat_doubt_know", "exp_sentence": "I doubt that Carla got a bird but I know she got a pet rat. The rat", "unexp_sentence": "I doubt that Carla got a bird but I know she got a pet rat. The bird", "type": "doubt_know", "order": 2}
{"id": "6_rat_affirmative_modal", "exp_sentence": "Carla got a pet rat but she wanted to get a bird. The rat", "unexp_sentence": "Carla got a pet rat but she wanted to get a bird. The bird", "type": "affirmative_modal", "order": 1}
{"id": "6_rat_affirmative_modal", "exp_sentence": "Carla got a bird but she wanted to get a pet rat. The bird", "unexp_sentence": "Carla got a bird but she wanted to get a pet rat. The rat", "type": "affirmative_modal", "order": 2}
{"id": "6_rat_modal_affirmative", "exp_sentence": "Carla wanted to get a pet rat but she got a bird. The bird", "unexp_sentence": "Carla wanted to get a pet rat but she got a bird. The rat", "type": "modal_affirmative", "order": 1}
{"id": "6_rat_modal_affirmative", "exp_sentence": "Carla wanted to get a bird but she got a pet rat. The rat", "unexp_sentence": "Carla wanted to get a bird but she got a pet rat. The bird", "type": "modal_affirmative", "order": 2}
{"id": "6_rat_managed_failed", "exp_sentence": "Carla managed to get a pet rat but failed to get a bird. The rat", "unexp_sentence": "Carla managed to get a pet rat but failed to get a bird. The bird", "type": "managed_failed", "order": 1}
{"id": "6_rat_managed_failed", "exp_sentence": "Carla managed to get a bird but failed to get a pet rat. The bird", "unexp_sentence": "Carla managed to get a bird but failed to get a pet rat. The rat", "type": "managed_failed", "order": 2}
{"id": "6_rat_failed_managed", "exp_sentence": "Carla failed to get a pet rat but managed to get a bird. The bird", "unexp_sentence": "Carla failed to get a pet rat but managed to get a bird. The rat", "type": "failed_managed", "order": 1}
{"id": "6_rat_failed_managed", "exp_sentence": "Carla failed to get a bird but managed to get a pet rat. The rat", "unexp_sentence": "Carla failed to get a bird but managed to get a pet rat. The bird", "type": "failed_managed", "order": 2}
{"id": "7_beer_affirmative_negation", "exp_sentence": "Sam ordered a beer at the bar but he didn't order a wine. The beer", "unexp_sentence": "Sam ordered a beer at the bar but he didn't order a wine. The wine", "type": "affirmative_negation", "order": 1}
{"id": "7_beer_affirmative_negation", "exp_sentence": "Sam ordered a wine at the bar but he didn't order a beer. The wine", "unexp_sentence": "Sam ordered a wine at the bar but he didn't order a beer. The beer", "type": "affirmative_negation", "order": 2}
{"id": "7_beer_negation_affirmative", "exp_sentence": "Sam didn't order a beer at the bar but he ordered a wine. The wine", "unexp_sentence": "Sam didn't order a beer at the bar but he ordered a wine. The beer", "type": "negation_affirmative", "order": 1}
{"id": "7_beer_negation_affirmative", "exp_sentence": "Sam didn't order a wine at the bar but he ordered a beer. The beer", "unexp_sentence": "Sam didn't order a wine at the bar but he ordered a beer. The wine", "type": "negation_affirmative", "order": 2}
{"id": "7_beer_know_doubt", "exp_sentence": "I know that Sam ordered a beer at the bar but I doubt that he ordered a wine. The beer", "unexp_sentence": "I know that Sam ordered a beer at the bar but I doubt that he ordered a wine. The wine", "type": "know_doubt", "order": 1}
{"id": "7_beer_know_doubt", "exp_sentence": "I know that Sam ordered a wine at the bar but I doubt that he ordered a beer. The wine", "unexp_sentence": "I know that Sam ordered a wine at the bar but I doubt that he ordered a beer. The beer", "type": "know_doubt", "order": 2}
{"id": "7_beer_doubt_know", "exp_sentence": "I doubt that Sam ordered a beer at the bar but I know that he ordered a wine. The wine", "unexp_sentence": "I doubt that Sam ordered a beer at the bar but I know that he ordered a wine. The beer", "type": "doubt_know", "order": 1}
{"id": "7_beer_doubt_know", "exp_sentence": "I doubt that Sam ordered a wine at the bar but I know that he ordered a beer. The beer", "unexp_sentence": "I doubt that Sam ordered a wine at the bar but I know that he ordered a beer. The wine", "type": "doubt_know", "order": 2}
{"id": "7_beer_affirmative_modal", "exp_sentence": "Sam ordered a beer at the bar but he wanted to order a wine. The beer", "unexp_sentence": "Sam ordered a beer at the bar but he wanted to order a wine. The wine", "type": "affirmative_modal", "order": 1}
{"id": "7_beer_affirmative_modal", "exp_sentence": "Sam ordered a wine at the bar but he wanted to order a beer. The wine", "unexp_sentence": "Sam ordered a wine at the bar but he wanted to order a beer. The beer", "type": "affirmative_modal", "order": 2}
{"id": "7_beer_modal_affirmative", "exp_sentence": "Sam wanted to order a beer at the bar but he ordered a wine. The wine", "unexp_sentence": "Sam wanted to order a beer at the bar but he ordered a wine. The beer", "type": "modal_affirmative", "order": 1}
{"id": "7_beer_modal_affirmative", "exp_sentence": "Sam wanted to order a wine at the bar but he ordered a beer. The beer", "unexp_sentence": "Sam wanted to order a wine at the bar but he ordered a beer. The wine", "type": "modal_affirmative", "order": 2}
{"id": "7_beer_managed_failed", "exp_sentence": "Sam managed to order a beer at the bar but failed to order a wine. The beer", "unexp_sentence": "Sam managed to order a beer at the bar but failed to order a wine. The wine", "type": "managed_failed", "order": 1}
{"id": "7_beer_managed_failed", "exp_sentence": "Sam managed to order a wine at the bar but failed to order a beer. The wine", "unexp_sentence": "Sam managed to order a wine at the bar but failed to order a beer. The beer", "type": "managed_failed", "order": 2}
{"id": "7_beer_failed_managed", "exp_sentence": "Sam failed to order a beer at the bar but managed to order a wine. The wine", "unexp_sentence": "Sam failed to order a beer at the bar but managed to order a wine. The beer", "type": "failed_managed", "order": 1}
{"id": "7_beer_failed_managed", "exp_sentence": "Sam failed to order a wine at the bar but managed to order a beer. The beer", "unexp_sentence": "Sam failed to order a wine at the bar but managed to order a beer. The wine", "type": "failed_managed", "order": 2}
{"id": "8_cake_affirmative_negation", "exp_sentence": "Michael baked a cake but he didn't bake a pie. The cake", "unexp_sentence": "Michael baked a cake but he didn't bake a pie. The pie", "type": "affirmative_negation", "order": 1}
{"id": "8_cake_affirmative_negation", "exp_sentence": "Michael baked a pie but he didn't bake a cake. The pie", "unexp_sentence": "Michael baked a pie but he didn't bake a cake. The cake", "type": "affirmative_negation", "order": 2}
{"id": "8_cake_negation_affirmative", "exp_sentence": "Michael didn't bake a cake but he baked a pie. The pie", "unexp_sentence": "Michael didn't bake a cake but he baked a pie. The cake", "type": "negation_affirmative", "order": 1}
{"id": "8_cake_negation_affirmative", "exp_sentence": "Michael didn't bake a pie but he baked a cake. The cake", "unexp_sentence": "Michael didn't bake a pie but he baked a cake. The pie", "type": "negation_affirmative", "order": 2}
{"id": "8_cake_know_doubt", "exp_sentence": "I know that Michael baked a cake but I doubt that he baked a pie. The cake", "unexp_sentence": "I know that Michael baked a cake but I doubt that he baked a pie. The pie", "type": "know_doubt", "order": 1}
{"id": "8_cake_know_doubt", "exp_sentence": "I know that Michael baked a pie but I doubt that he baked a cake. The pie", "unexp_sentence": "I know that Michael baked a pie but I doubt that he baked a cake. The cake", "type": "know_doubt", "order": 2}
{"id": "8_cake_doubt_know", "exp_sentence": "I doubt that Michael baked a cake but I know that he baked a pie. The pie", "unexp_sentence": "I doubt that Michael baked a cake but I know that he baked a pie. The cake", "type": "doubt_know", "order": 1}
{"id": "8_cake_doubt_know", "exp_sentence": "I doubt that Michael baked a pie but I know that he baked a cake. The cake", "unexp_sentence": "I doubt that Michael baked a pie but I know that he baked a cake. The pie", "type": "doubt_know", "order": 2}
{"id": "8_cake_affirmative_modal", "exp_sentence": "Michael baked a cake but he wanted to bake a pie. The cake", "unexp_sentence": "Michael baked a cake but he wanted to bake a pie. The pie", "type": "affirmative_modal", "order": 1}
{"id": "8_cake_affirmative_modal", "exp_sentence": "Michael baked a pie but he wanted to bake a cake. The pie", "unexp_sentence": "Michael baked a pie but he wanted to bake a cake. The cake", "type": "affirmative_modal", "order": 2}
{"id": "8_cake_modal_affirmative", "exp_sentence": "Michael wanted to bake a cake but he baked a pie. The pie", "unexp_sentence": "Michael wanted to bake a cake but he baked a pie. The cake", "type": "modal_affirmative", "order": 1}
{"id": "8_cake_modal_affirmative", "exp_sentence": "Michael wanted to bake a pie but he baked a cake. The cake", "unexp_sentence": "Michael wanted to bake a pie but he baked a cake. The pie", "type": "modal_affirmative", "order": 2}
{"id": "8_cake_managed_failed", "exp_sentence": "Michael managed to bake a cake but failed to bake a pie. The cake", "unexp_sentence": "Michael managed to bake a cake but failed to bake a pie. The pie", "type": "managed_failed", "order": 1}
{"id": "8_cake_managed_failed", "exp_sentence": "Michael managed to bake a pie but failed to bake a cake. The pie", "unexp_sentence": "Michael managed to bake a pie but failed to bake a cake. The cake", "type": "managed_failed", "order": 2}
{"id": "8_cake_failed_managed", "exp_sentence": "Michael failed to bake a cake but managed to bake a pie. The pie", "unexp_sentence": "Michael failed to bake a cake but managed to bake a pie. The cake", "type": "failed_managed", "order": 1}
{"id": "8_cake_failed_managed", "exp_sentence": "Michael failed to bake a pie but managed to bake a cake. The cake", "unexp_sentence": "Michael failed to bake a pie but managed to bake a cake. The pie", "type": "failed_managed", "order": 2}
{"id": "9_letter_affirmative_negation", "exp_sentence": "Carolyn wrote a letter to her parents but she didn't write them a card. The letter", "unexp_sentence": "Carolyn wrote a letter to her parents but she didn't write them a card. The card", "type": "affirmative_negation", "order": 1}
{"id": "9_letter_affirmative_negation", "exp_sentence": "Carolyn wrote a card to her parents but she didn't write them a letter. The card", "unexp_sentence": "Carolyn wrote a card to her parents but she didn't write them a letter. The letter", "type": "affirmative_negation", "order": 2}
{"id": "9_letter_negation_affirmative", "exp_sentence": "Carolyn didn't write a letter to her parents but she wrote them a card. The card", "unexp_sentence": "Carolyn didn't write a letter to her parents but she wrote them a card. The letter", "type": "negation_affirmative", "order": 1}
{"id": "9_letter_negation_affirmative", "exp_sentence": "Carolyn didn't write a card to her parents but she wrote them a letter. The letter", "unexp_sentence": "Carolyn didn't write a card to her parents but she wrote them a letter. The card", "type": "negation_affirmative", "order": 2}
{"id": "9_letter_know_doubt", "exp_sentence": "I know that Carolyn wrote a letter to her parents but I doubt that she wrote them a card. The letter", "unexp_sentence": "I know that Carolyn wrote a letter to her parents but I doubt that she wrote them a card. The card", "type": "know_doubt", "order": 1}
{"id": "9_letter_know_doubt", "exp_sentence": "I know that Carolyn wrote a card to her parents but I doubt that she wrote them a letter. The card", "unexp_sentence": "I know that Carolyn wrote a card to her parents but I doubt that she wrote them a letter. The letter", "type": "know_doubt", "order": 2}
{"id": "9_letter_doubt_know", "exp_sentence": "I doubt that Carolyn wrote a letter to her parents but I know that she wrote them a card. The card", "unexp_sentence": "I doubt that Carolyn wrote a letter to her parents but I know that she wrote them a card. The letter", "type": "doubt_know", "order": 1}
{"id": "9_letter_doubt_know", "exp_sentence": "I doubt that Carolyn wrote a card to her parents but I know that she wrote them a letter. The letter", "unexp_sentence": "I doubt that Carolyn wrote a card to her parents but I know that she wrote them a letter. The card", "type": "doubt_know", "order": 2}
{"id": "9_letter_affirmative_modal", "exp_sentence": "Carolyn wrote a letter to her parents but she wanted to write them a card. The letter", "unexp_sentence": "Carolyn wrote a letter to her parents but she wanted to write them a card. The card", "type": "affirmative_modal", "order": 1}
{"id": "9_letter_affirmative_modal", "exp_sentence": "Carolyn wrote a card to her parents but she wanted to write them a letter. The card", "unexp_sentence": "Carolyn wrote a card to her parents but she wanted to write them a letter. The letter", "type": "affirmative_modal", "order": 2}
{"id": "9_letter_modal_affirmative", "exp_sentence": "Carolyn wanted to write a letter to her parents but she wrote them a card. The card", "unexp_sentence": "Carolyn wanted to write a letter to her parents but she wrote them a card. The letter", "type": "modal_affirmative", "order": 1}
{"id": "9_letter_modal_affirmative", "exp_sentence": "Carolyn wanted to write a card to her parents but she wrote them a letter. The letter", "unexp_sentence": "Carolyn wanted to write a card to her parents but she wrote them a letter. The card", "type": "modal_affirmative", "order": 2}
{"id": "9_letter_managed_failed", "exp_sentence": "Carolyn managed to write a letter to her parents but failed to write them a card. The letter", "unexp_sentence": "Carolyn managed to write a letter to her parents but failed to write them a card. The card", "type": "managed_failed", "order": 1}
{"id": "9_letter_managed_failed", "exp_sentence": "Carolyn managed to write a card to her parents but failed to write them a letter. The card", "unexp_sentence": "Carolyn managed to write a card to her parents but failed to write them a letter. The letter", "type": "managed_failed", "order": 2}
{"id": "9_letter_failed_managed", "exp_sentence": "Carolyn failed to write a letter to her parents but managed to write them a card. The card", "unexp_sentence": "Carolyn failed to write a letter to her parents but managed to write them a card. The letter", "type": "failed_managed", "order": 1}
{"id": "9_letter_failed_managed", "exp_sentence": "Carolyn failed to write a card to her parents but managed to write them a letter. The letter", "unexp_sentence": "Carolyn failed to write a card to her parents but managed to write them a letter. The card", "type": "failed_managed", "order": 2}
{"id": "10_hat_affirmative_negation", "exp_sentence": "Chris knitted a hat but he didn't knit a bag. The hat", "unexp_sentence": "Chris knitted a hat but he didn't knit a bag. The bag", "type": "affirmative_negation", "order": 1}
{"id": "10_hat_affirmative_negation", "exp_sentence": "Chris knitted a bag but he didn't knit a hat. The bag", "unexp_sentence": "Chris knitted a bag but he didn't knit a hat. The hat", "type": "affirmative_negation", "order": 2}
{"id": "10_hat_negation_affirmative", "exp_sentence": "Chris didn't knit a hat but he knitted a bag. The bag", "unexp_sentence": "Chris didn't knit a hat but he knitted a bag. The hat", "type": "negation_affirmative", "order": 1}
{"id": "10_hat_negation_affirmative", "exp_sentence": "Chris didn't knit a bag but he knitted a hat. The hat", "unexp_sentence": "Chris didn't knit a bag but he knitted a hat. The bag", "type": "negation_affirmative", "order": 2}
{"id": "10_hat_know_doubt", "exp_sentence": "I know that Chris knitted a hat but I doubt that he knitted a bag. The hat", "unexp_sentence": "I know that Chris knitted a hat but I doubt that he knitted a bag. The bag", "type": "know_doubt", "order": 1}
{"id": "10_hat_know_doubt", "exp_sentence": "I know that Chris knitted a bag but I doubt that he knitted a hat. The bag", "unexp_sentence": "I know that Chris knitted a bag but I doubt that he knitted a hat. The hat", "type": "know_doubt", "order": 2}
{"id": "10_hat_doubt_know", "exp_sentence": "I doubt that Chris knitted a hat but I know that he knitted a bag. The bag", "unexp_sentence": "I doubt that Chris knitted a hat but I know that he knitted a bag. The hat", "type": "doubt_know", "order": 1}
{"id": "10_hat_doubt_know", "exp_sentence": "I doubt that Chris knitted a bag but I know that he knitted a hat. The hat", "unexp_sentence": "I doubt that Chris knitted a bag but I know that he knitted a hat. The bag", "type": "doubt_know", "order": 2}
{"id": "10_hat_affirmative_modal", "exp_sentence": "Chris knitted a hat but he wanted to knit a bag. The hat", "unexp_sentence": "Chris knitted a hat but he wanted to knit a bag. The bag", "type": "affirmative_modal", "order": 1}
{"id": "10_hat_affirmative_modal", "exp_sentence": "Chris knitted a bag but he wanted to knit a hat. The bag", "unexp_sentence": "Chris knitted a bag but he wanted to knit a hat. The hat", "type": "affirmative_modal", "order": 2}
{"id": "10_hat_modal_affirmative", "exp_sentence": "Chris wanted to knit a hat but he knitted a bag. The bag", "unexp_sentence": "Chris wanted to knit a hat but he knitted a bag. The hat", "type": "modal_affirmative", "order": 1}
{"id": "10_hat_modal_affirmative", "exp_sentence": "Chris wanted to knit a bag but he knitted a hat. The hat", "unexp_sentence": "Chris wanted to knit a bag but he knitted a hat. The bag", "type": "modal_affirmative", "order": 2}
{"id": "10_hat_managed_failed", "exp_sentence": "Chris managed to knit a hat but failed to knit a bag. The hat", "unexp_sentence": "Chris managed to knit a hat but failed to knit a bag. The bag", "type": "managed_failed", "order": 1}
{"id": "10_hat_managed_failed", "exp_sentence": "Chris managed to knit a bag but failed to knit a hat. The bag", "unexp_sentence": "Chris managed to knit a bag but failed to knit a hat. The hat", "type": "managed_failed", "order": 2}
{"id": "10_hat_failed_managed", "exp_sentence": "Chris failed to knit a hat but managed to knit a bag. The bag", "unexp_sentence": "Chris failed to knit a hat but managed to knit a bag. The hat", "type": "failed_managed", "order": 1}
{"id": "10_hat_failed_managed", "exp_sentence": "Chris failed to knit a bag but managed to knit a hat. The hat", "unexp_sentence": "Chris failed to knit a bag but managed to knit a hat. The bag", "type": "failed_managed", "order": 2}
{"id": "11_cod_affirmative_negation", "exp_sentence": "Sarah caught a cod but she didn't catch a bass. The cod", "unexp_sentence": "Sarah caught a cod but she didn't catch a bass. The bass", "type": "affirmative_negation", "order": 1}
{"id": "11_cod_affirmative_negation", "exp_sentence": "Sarah caught a bass but she didn't catch a cod. The bass", "unexp_sentence": "Sarah caught a bass but she didn't catch a cod. The cod", "type": "affirmative_negation", "order": 2}
{"id": "11_cod_negation_affirmative", "exp_sentence": "Sarah didn't catch a cod but she caught a bass. The bass", "unexp_sentence": "Sarah didn't catch a cod but she caught a bass. The cod", "type": "negation_affirmative", "order": 1}
{"id": "11_cod_negation_affirmative", "exp_sentence": "Sarah didn't catch a bass but she caught a cod. The cod", "unexp_sentence": "Sarah didn't catch a bass but she caught a cod. The bass", "type": "negation_affirmative", "order": 2}
{"id": "11_cod_know_doubt", "exp_sentence": "I know that Sarah caught a cod but I doubt that she caught a bass. The cod", "unexp_sentence": "I know that Sarah caught a cod but I doubt that she caught a bass. The bass", "type": "know_doubt", "order": 1}
{"id": "11_cod_know_doubt", "exp_sentence": "I know that Sarah caught a bass but I doubt that she caught a cod. The bass", "unexp_sentence": "I know that Sarah caught a bass but I doubt that she caught a cod. The cod", "type": "know_doubt", "order": 2}
{"id": "11_cod_doubt_know", "exp_sentence": "I doubt that Sarah caught a cod but I know that she caught a bass. The bass", "unexp_sentence": "I doubt that Sarah caught a cod but I know that she caught a bass. The cod", "type": "doubt_know", "order": 1}
{"id": "11_cod_doubt_know", "exp_sentence": "I doubt that Sarah caught a bass but I know that she caught a cod. The cod", "unexp_sentence": "I doubt that Sarah caught a bass but I know that she caught a cod. The bass", "type": "doubt_know", "order": 2}
{"id": "11_cod_affirmative_modal", "exp_sentence": "Sarah caught a cod but she wanted to catch a bass. The cod", "unexp_sentence": "Sarah caught a cod but she wanted to catch a bass. The bass", "type": "affirmative_modal", "order": 1}
{"id": "11_cod_affirmative_modal", "exp_sentence": "Sarah caught a bass but she wanted to catch a cod. The bass", "unexp_sentence": "Sarah caught a bass but she wanted to catch a cod. The cod", "type": "affirmative_modal", "order": 2}
{"id": "11_cod_modal_affirmative", "exp_sentence": "Sarah wanted to catch a cod but she caught a bass. The bass", "unexp_sentence": "Sarah wanted to catch a cod but she caught a bass. The cod", "type": "modal_affirmative", "order": 1}
{"id": "11_cod_modal_affirmative", "exp_sentence": "Sarah wanted to catch a bass but she caught a cod. The cod", "unexp_sentence": "Sarah wanted to catch a bass but she caught a cod. The bass", "type": "modal_affirmative", "order": 2}
{"id": "11_cod_managed_failed", "exp_sentence": "Sarah managed to catch a cod but failed to catch a bass. The cod", "unexp_sentence": "Sarah managed to catch a cod but failed to catch a bass. The bass", "type": "managed_failed", "order": 1}
{"id": "11_cod_managed_failed", "exp_sentence": "Sarah managed to catch a bass but failed to catch a cod. The bass", "unexp_sentence": "Sarah managed to catch a bass but failed to catch a cod. The cod", "type": "managed_failed", "order": 2}
{"id": "11_cod_failed_managed", "exp_sentence": "Sarah failed to catch a cod but managed to catch a bass. The bass", "unexp_sentence": "Sarah failed to catch a cod but managed to catch a bass. The cod", "type": "failed_managed", "order": 1}
{"id": "11_cod_failed_managed", "exp_sentence": "Sarah failed to catch a bass but managed to catch a cod. The cod", "unexp_sentence": "Sarah failed to catch a bass but managed to catch a cod. The bass", "type": "failed_managed", "order": 2}
{"id": "12_ticket_affirmative_negation", "exp_sentence": "Thomas booked a ticket in advance but he didn't book a hotel room. The ticket", "unexp_sentence": "Thomas booked a ticket in advance but he didn't book a hotel room. The room", "type": "affirmative_negation", "order": 1}
{"id": "12_ticket_affirmative_negation", "exp_sentence": "Thomas booked a hotel room in advance but he didn't book a ticket. The room", "unexp_sentence": "Thomas booked a hotel room in advance but he didn't book a ticket. The ticket", "type": "affirmative_negation", "order": 2}
{"id": "12_ticket_negation_affirmative", "exp_sentence": "Thomas didn't book a ticket in advance but he booked a hotel room. The room", "unexp_sentence": "Thomas didn't book a ticket in advance but he booked a hotel room. The ticket", "type": "negation_affirmative", "order": 1}
{"id": "12_ticket_negation_affirmative", "exp_sentence": "Thomas didn't book a hotel room in advance but he booked a ticket. The ticket", "unexp_sentence": "Thomas didn't book a hotel room in advance but he booked a ticket. The room", "type": "negation_affirmative", "order": 2}
{"id": "12_ticket_know_doubt", "exp_sentence": "I know that Thomas booked a ticket in advance but I doubt that he booked a hotel room. The ticket", "unexp_sentence": "I know that Thomas booked a ticket in advance but I doubt that he booked a hotel room. The room", "type": "know_doubt", "order": 1}
{"id": "12_ticket_know_doubt", "exp_sentence": "I know that Thomas booked a hotel room in advance but I doubt that he booked a ticket. The room", "unexp_sentence": "I know that Thomas booked a hotel room in advance but I doubt that he booked a ticket. The ticket", "type": "know_doubt", "order": 2}
{"id": "12_ticket_doubt_know", "exp_sentence": "I doubt that Thomas booked a ticket in advance but I know that he booked a hotel room. The room", "unexp_sentence": "I doubt that Thomas booked a ticket in advance but I know that he booked a hotel room. The ticket", "type": "doubt_know", "order": 1}
{"id": "12_ticket_doubt_know", "exp_sentence": "I doubt that Thomas booked a hotel room in advance but I know that he booked a ticket. The ticket", "unexp_sentence": "I doubt that Thomas booked a hotel room in advance but I know that he booked a ticket. The room", "type": "doubt_know", "order": 2}
{"id": "12_ticket_affirmative_modal", "exp_sentence": "Thomas booked a ticket in advance but he wanted to book a hotel room. The ticket", "unexp_sentence": "Thomas booked a ticket in advance but he wanted to book a hotel room. The room", "type": "affirmative_modal", "order": 1}
{"id": "12_ticket_affirmative_modal", "exp_sentence": "Thomas booked a hotel room in advance but he wanted to book a ticket. The room", "unexp_sentence": "Thomas booked a hotel room in advance but he wanted to book a ticket. The ticket", "type": "affirmative_modal", "order": 2}
{"id": "12_ticket_modal_affirmative", "exp_sentence": "Thomas wanted to book a ticket in advance but he booked a hotel room. The room", "unexp_sentence": "Thomas wanted to book a ticket in advance but he booked a hotel room. The ticket", "type": "modal_affirmative", "order": 1}
{"id": "12_ticket_modal_affirmative", "exp_sentence": "Thomas wanted to book a hotel room in advance but he booked a ticket. The ticket", "unexp_sentence": "Thomas wanted to book a hotel room in advance but he booked a ticket. The room", "type": "modal_affirmative", "order": 2}
{"id": "12_ticket_managed_failed", "exp_sentence": "Thomas managed to book a ticket in advance but failed to book a hotel room. The ticket", "unexp_sentence": "Thomas managed to book a ticket in advance but failed to book a hotel room. The room", "type": "managed_failed", "order": 1}
{"id": "12_ticket_managed_failed", "exp_sentence": "Thomas managed to book a hotel room in advance but failed to book a ticket. The room", "unexp_sentence": "Thomas managed to book a hotel room in advance but failed to book a ticket. The ticket", "type": "managed_failed", "order": 2}
{"id": "12_ticket_failed_managed", "exp_sentence": "Thomas failed to book a ticket in advance but managed to book a hotel room. The room", "unexp_sentence": "Thomas failed to book a ticket in advance but managed to book a hotel room. The ticket", "type": "failed_managed", "order": 1}
{"id": "12_ticket_failed_managed", "exp_sentence": "Thomas failed to book a hotel room in advance but managed to book a ticket. The ticket", "unexp_sentence": "Thomas failed to book a hotel room in advance but managed to book a ticket. The room", "type": "failed_managed", "order": 2}
{"id": "13_bed_affirmative_negation", "exp_sentence": "Luke bought a bed but he didn't buy a table. The bed", "unexp_sentence": "Luke bought a bed but he didn't buy a table. The table", "type": "affirmative_negation", "order": 1}
{"id": "13_bed_affirmative_negation", "exp_sentence": "Luke bought a table but he didn't buy a bed. The table", "unexp_sentence": "Luke bought a table but he didn't buy a bed. The bed", "type": "affirmative_negation", "order": 2}
{"id": "13_bed_negation_affirmative", "exp_sentence": "Luke didn't buy a bed but he bought a table. The table", "unexp_sentence": "Luke didn't buy a bed but he bought a table. The bed", "type": "negation_affirmative", "order": 1}
{"id": "13_bed_negation_affirmative", "exp_sentence": "Luke didn't buy a table but he bought a bed. The bed", "unexp_sentence": "Luke didn't buy a table but he bought a bed. The table", "type": "negation_affirmative", "order": 2}
{"id": "13_bed_know_doubt", "exp_sentence": "I know that Luke bought a bed but I doubt that he bought a table. The bed", "unexp_sentence": "I know that Luke bought a bed but I doubt that he bought a table. The table", "type": "know_doubt", "order": 1}
{"id": "13_bed_know_doubt", "exp_sentence": "I know that Luke bought a table but I doubt that he bought a bed. The table", "unexp_sentence": "I know that Luke bought a table but I doubt that he bought a bed. The bed", "type": "know_doubt", "order": 2}
{"id": "13_bed_doubt_know", "exp_sentence": "I know that Luke bought a bed but I doubt that he bought a table. The table", "unexp_sentence": "I know that Luke bought a bed but I doubt that he bought a table. The bed", "type": "doubt_know", "order": 1}
{"id": "13_bed_doubt_know", "exp_sentence": "I know that Luke bought a table but I doubt that he bought a bed. The bed", "unexp_sentence": "I know that Luke bought a table but I doubt that he bought a bed. The table", "type": "doubt_know", "order": 2}
{"id": "13_bed_affirmative_modal", "exp_sentence": "Luke bought a bed but he wanted to buy a table. The bed", "unexp_sentence": "Luke bought a bed but he wanted to buy a table. The table", "type": "affirmative_modal", "order": 1}
{"id": "13_bed_affirmative_modal", "exp_sentence": "Luke bought a table but he wanted to buy a bed. The table", "unexp_sentence": "Luke bought a table but he wanted to buy a bed. The bed", "type": "affirmative_modal", "order": 2}
{"id": "13_bed_modal_affirmative", "exp_sentence": "Luke wanted to buy a bed but he bought a table. The table", "unexp_sentence": "Luke wanted to buy a bed but he bought a table. The bed", "type": "modal_affirmative", "order": 1}
{"id": "13_bed_modal_affirmative", "exp_sentence": "Luke wanted to buy a table but he bought a bed. The bed", "unexp_sentence": "Luke wanted to buy a table but he bought a bed. The table", "type": "modal_affirmative", "order": 2}
{"id": "13_bed_managed_failed", "exp_sentence": "Luke managed to buy a bed but he failed to buy a table. The bed", "unexp_sentence": "Luke managed to buy a bed but he failed to buy a table. The table", "type": "managed_failed", "order": 1}
{"id": "13_bed_managed_failed", "exp_sentence": "Luke managed to buy a table but he failed to buy a bed. The table", "unexp_sentence": "Luke managed to buy a table but he failed to buy a bed. The bed", "type": "managed_failed", "order": 2}
{"id": "13_bed_failed_managed", "exp_sentence": "Luke failed to buy a bed but he managed to buy a table. The table", "unexp_sentence": "Luke failed to buy a bed but he managed to buy a table. The bed", "type": "failed_managed", "order": 1}
{"id": "13_bed_failed_managed", "exp_sentence": "Luke failed to buy a table but he managed to buy a bed. The bed", "unexp_sentence": "Luke failed to buy a table but he managed to buy a bed. The table", "type": "failed_managed", "order": 2}
{"id": "14_gin_affirmative_negation", "exp_sentence": "Dan drank a gin tonic but he didn't drink a water. The gin", "unexp_sentence": "Dan drank a gin tonic but he didn't drink a water. The water", "type": "affirmative_negation", "order": 1}
{"id": "14_gin_affirmative_negation", "exp_sentence": "Dan drank a water but he didn't drink a gin tonic. The water", "unexp_sentence": "Dan drank a water but he didn't drink a gin tonic. The gin", "type": "affirmative_negation", "order": 2}
{"id": "14_gin_negation_affirmative", "exp_sentence": "Dan didn't drink a gin tonic but he drank a water. The water", "unexp_sentence": "Dan didn't drink a gin tonic but he drank a water. The gin", "type": "negation_affirmative", "order": 1}
{"id": "14_gin_negation_affirmative", "exp_sentence": "Dan didn't drink a water but he drank a gin tonic. The gin", "unexp_sentence": "Dan didn't drink a water but he drank a gin tonic. The water", "type": "negation_affirmative", "order": 2}
{"id": "14_gin_know_doubt", "exp_sentence": "I know that Dan drank a gin tonic but I doubt that he drank a water. The gin", "unexp_sentence": "I know that Dan drank a gin tonic but I doubt that he drank a water. The water", "type": "know_doubt", "order": 1}
{"id": "14_gin_know_doubt", "exp_sentence": "I know that Dan drank a water but I doubt that he drank a gin tonic. The water", "unexp_sentence": "I know that Dan drank a water but I doubt that he drank a gin tonic. The gin", "type": "know_doubt", "order": 2}
{"id": "14_gin_doubt_know", "exp_sentence": "I doubt that Dan drank a gin tonic but I know that he drank a water. The water", "unexp_sentence": "I doubt that Dan drank a gin tonic but I know that he drank a water. The gin", "type": "doubt_know", "order": 1}
{"id": "14_gin_doubt_know", "exp_sentence": "I doubt that Dan drank a water but I know that he drank a gin tonic. The gin", "unexp_sentence": "I doubt that Dan drank a water but I know that he drank a gin tonic. The water", "type": "doubt_know", "order": 2}
{"id": "14_gin_affirmative_modal", "exp_sentence": "Dan drank a gin tonic but he wanted to drink a water. The gin", "unexp_sentence": "Dan drank a gin tonic but he wanted to drink a water. The water", "type": "affirmative_modal", "order": 1}
{"id": "14_gin_affirmative_modal", "exp_sentence": "Dan drank a water but he wanted to drink a gin tonic. The water", "unexp_sentence": "Dan drank a water but he wanted to drink a gin tonic. The gin", "type": "affirmative_modal", "order": 2}
{"id": "14_gin_modal_affirmative", "exp_sentence": "Dan wanted to drink a gin tonic but he drank a water. The water", "unexp_sentence": "Dan wanted to drink a gin tonic but he drank a water. The gin", "type": "modal_affirmative", "order": 1}
{"id": "14_gin_modal_affirmative", "exp_sentence": "Dan wanted to drink a water but he drank a gin tonic. The gin", "unexp_sentence": "Dan wanted to drink a water but he drank a gin tonic. The water", "type": "modal_affirmative", "order": 2}
{"id": "14_gin_managed_failed", "exp_sentence": "Dan managed to mix a gin tonic but failed to get a water. The gin", "unexp_sentence": "Dan managed to mix a gin tonic but failed to get a water. The water", "type": "managed_failed", "order": 1}
{"id": "14_gin_managed_failed", "exp_sentence": "Dan managed to get a water but failed to mix a gin tonic. The water", "unexp_sentence": "Dan managed to get a water but failed to mix a gin tonic. The gin", "type": "managed_failed", "order": 2}
{"id": "14_gin_failed_managed", "exp_sentence": "Dan failed to mix a gin tonic but managed to get a water. The water", "unexp_sentence": "Dan failed to mix a gin tonic but managed to get a water. The gin", "type": "failed_managed", "order": 1}
{"id": "14_gin_failed_managed", "exp_sentence": "Dan failed to get a water but managed to mix a gin tonic. The gin", "unexp_sentence": "Dan failed to get a water but managed to mix a gin tonic. The water", "type": "failed_managed", "order": 2}
{"id": "15_bone_affirmative_negation", "exp_sentence": "David discovered an old jar on his archaeological expedition but he didn't discover a bone. The jar", "unexp_sentence": "David discovered an old jar on his archaeological expedition but he didn't discover a bone. The bone", "type": "affirmative_negation", "order": 1}
{"id": "15_bone_affirmative_negation", "exp_sentence": "David discovered a bone on his archaeological expedition but he didn't discover an old jar. The bone", "unexp_sentence": "David discovered a bone on his archaeological expedition but he didn't discover an old jar. The jar", "type": "affirmative_negation", "order": 2}
{"id": "15_bone_negation_affirmative", "exp_sentence": "David didn't discover an old jar on his archaeological expedition but he discovered a bone. The bone", "unexp_sentence": "David didn't discover an old jar on his archaeological expedition but he discovered a bone. The jar", "type": "negation_affirmative", "order": 1}
{"id": "15_bone_negation_affirmative", "exp_sentence": "David didn't discover a bone on his archaeological expedition but he discovered an old jar. The jar", "unexp_sentence": "David didn't discover a bone on his archaeological expedition but he discovered an old jar. The bone", "type": "negation_affirmative", "order": 2}
{"id": "15_bone_know_doubt", "exp_sentence": "I know that David discovered an old jar on his archaeological expedition but I doubt that he discovered a bone. The jar", "unexp_sentence": "I know that David discovered an old jar on his archaeological expedition but I doubt that he discovered a bone. The bone", "type": "know_doubt", "order": 1}
{"id": "15_bone_know_doubt", "exp_sentence": "I know that David discovered a bone on his archaeological expedition but I doubt that he discovered an old jar. The bone", "unexp_sentence": "I know that David discovered a bone on his archaeological expedition but I doubt that he discovered an old jar. The jar", "type": "know_doubt", "order": 2}
{"id": "15_bone_doubt_know", "exp_sentence": "I doubt that David discovered an old jar on his archaeological expedition but I know that he discovered a bone. The bone", "unexp_sentence": "I doubt that David discovered an old jar on his archaeological expedition but I know that he discovered a bone. The jar", "type": "doubt_know", "order": 1}
{"id": "15_bone_doubt_know", "exp_sentence": "I doubt that David discovered a bone on his archaeological expedition but I know that he discovered an old jar. The jar", "unexp_sentence": "I doubt that David discovered a bone on his archaeological expedition but I know that he discovered an old jar. The bone", "type": "doubt_know", "order": 2}
{"id": "15_bone_affirmative_modal", "exp_sentence": "David discovered an old jar on his archaeological expedition but he wanted to discover a bone. The jar", "unexp_sentence": "David discovered an old jar on his archaeological expedition but he wanted to discover a bone. The bone", "type": "affirmative_modal", "order": 1}
{"id": "15_bone_affirmative_modal", "exp_sentence": "David discovered a bone on his archaeological expedition but he wanted to discover an old jar. The bone", "unexp_sentence": "David discovered a bone on his archaeological expedition but he wanted to discover an old jar. The jar", "type": "affirmative_modal", "order": 2}
{"id": "15_bone_modal_affirmative", "exp_sentence": "David wanted to discover an old jar on his archaeological expedition but he discovered a bone. The bone", "unexp_sentence": "David wanted to discover an old jar on his archaeological expedition but he discovered a bone. The jar", "type": "modal_affirmative", "order": 1}
{"id": "15_bone_modal_affirmative", "exp_sentence": "David wanted to discover a bone on his archaeological expedition but he discovered an old jar. The jar", "unexp_sentence": "David wanted to discover a bone on his archaeological expedition but he discovered an old jar. The bone", "type": "modal_affirmative", "order": 2}
{"id": "15_bone_managed_failed", "exp_sentence": "David managed to discover an old jar on his archaeological expedition but failed to discover a bone. The jar", "unexp_sentence": "David managed to discover an old jar on his archaeological expedition but failed to discover a bone. The bone", "type": "managed_failed", "order": 1}
{"id": "15_bone_managed_failed", "exp_sentence": "David managed to discover a bone on his archaeological expedition but failed to discover an old jar. The bone", "unexp_sentence": "David managed to discover a bone on his archaeological expedition but failed to discover an old jar. The jar", "type": "managed_failed", "order": 2}
{"id": "15_bone_failed_managed", "exp_sentence": "David failed to discover an old jar on his archaeological expedition but managed to discover a bone. The bone", "unexp_sentence": "David failed to discover an old jar on his archaeological expedition but managed to discover a bone. The jar", "type": "failed_managed", "order": 1}
{"id": "15_bone_failed_managed", "exp_sentence": "David failed to discover a bone on his archaeological expedition but managed to discover an old jar. The jar", "unexp_sentence": "David failed to discover a bone on his archaeological expedition but managed to discover an old jar. The bone", "type": "failed_managed", "order": 2}
{"id": "16_house_affirmative_negation", "exp_sentence": "Lisa built a house but she didn't build a shed. The house", "unexp_sentence": "Lisa built a house but she didn't build a shed. The shed", "type": "affirmative_negation", "order": 1}
{"id": "16_house_affirmative_negation", "exp_sentence": "Lisa built a shed but she didn't build a house. The shed", "unexp_sentence": "Lisa built a shed but she didn't build a house. The house", "type": "affirmative_negation", "order": 2}
{"id": "16_house_negation_affirmative", "exp_sentence": "Lisa didn't build a house but she built a shed. The shed", "unexp_sentence": "Lisa didn't build a house but she built a shed. The house", "type": "negation_affirmative", "order": 1}
{"id": "16_house_negation_affirmative", "exp_sentence": "Lisa didn't build a shed but she built a house. The house", "unexp_sentence": "Lisa didn't build a shed but she built a house. The shed", "type": "negation_affirmative", "order": 2}
{"id": "16_house_know_doubt", "exp_sentence": "I know that Lisa built a house but I doubt that she built a shed. The house", "unexp_sentence": "I know that Lisa built a house but I doubt that she built a shed. The shed", "type": "know_doubt", "order": 1}
{"id": "16_house_know_doubt", "exp_sentence": "I know that Lisa built a shed but I doubt that she built a house. The shed", "unexp_sentence": "I know that Lisa built a shed but I doubt that she built a house. The house", "type": "know_doubt", "order": 2}
{"id": "16_house_doubt_know", "exp_sentence": "I doubt that Lisa built a house but I know that she built a shed. The shed", "unexp_sentence": "I doubt that Lisa built a house but I know that she built a shed. The house", "type": "doubt_know", "order": 1}
{"id": "16_house_doubt_know", "exp_sentence": "I doubt that Lisa built a shed but I know that she built a house. The house", "unexp_sentence": "I doubt that Lisa built a shed but I know that she built a house. The shed", "type": "doubt_know", "order": 2}
{"id": "16_house_affirmative_modal", "exp_sentence": "Lisa built a house but she wanted to build a shed. The house", "unexp_sentence": "Lisa built a house but she wanted to build a shed. The shed", "type": "affirmative_modal", "order": 1}
{"id": "16_house_affirmative_modal", "exp_sentence": "Lisa built a shed but she wanted to build a house. The shed", "unexp_sentence": "Lisa built a shed but she wanted to build a house. The house", "type": "affirmative_modal", "order": 2}
{"id": "16_house_modal_affirmative", "exp_sentence": "Lisa wanted to build a house but she built a shed. The shed", "unexp_sentence": "Lisa wanted to build a house but she built a shed. The house", "type": "modal_affirmative", "order": 1}
{"id": "16_house_modal_affirmative", "exp_sentence": "Lisa wanted to build a shed but she built a house. The house", "unexp_sentence": "Lisa wanted to build a shed but she built a house. The shed", "type": "modal_affirmative", "order": 2}
{"id": "16_house_managed_failed", "exp_sentence": "Lisa managed to build a house but failed to build a shed. The house", "unexp_sentence": "Lisa managed to build a house but failed to build a shed. The shed", "type": "managed_failed", "order": 1}
{"id": "16_house_managed_failed", "exp_sentence": "Lisa managed to build a shed but failed to build a house. The shed", "unexp_sentence": "Lisa managed to build a shed but failed to build a house. The house", "type": "managed_failed", "order": 2}
{"id": "16_house_failed_managed", "exp_sentence": "Lisa failed to build a house but managed to build a shed. The shed", "unexp_sentence": "Lisa failed to build a house but managed to build a shed. The house", "type": "failed_managed", "order": 1}
{"id": "16_house_failed_managed", "exp_sentence": "Lisa failed to build a shed but managed to build a house. The house", "unexp_sentence": "Lisa failed to build a shed but managed to build a house. The shed", "type": "failed_managed", "order": 2}
