{"id": "1_dog_affirmative", "i_sentence": "John owns a dog and it follows him everywhere he goes.", "s_sentence": "John owns a dog and he is thinking about getting another one.", "type": "affirmative"}
{"id": "1_dog_negated", "i_sentence": "John doesn't own a dog and it follows him everywhere he goes.", "s_sentence": "John doesn't own a dog and he isn't planning on getting one.", "type": "negated"}
{"id": "1_dog_know", "i_sentence": "I know that John owns a dog. It follows him everywhere he goes.", "s_sentence": "I know that John owns a dog. He is thinking about getting another one.", "type": "know"}
{"id": "1_dog_doubt", "i_sentence": "I doubt that John owns a dog. It follows him everywhere he goes.", "s_sentence": "I doubt that John owns a dog. He doesn't own any other pets either.", "type": "doubt"}
{"id": "1_dog_modal", "i_sentence": "John wants to own a dog and it follows him everywhere he goes.", "s_sentence": "John wants to own a dog and he cannot wait to move to a building that allows pets.", "type": "modal"}
{"id": "1_dog_managed", "i_sentence": "John managed to adopt a dog. It follows him everywhere he goes.", "s_sentence": "John managed to adopt a dog. He only needed permission from his landlord.", "type": "managed"}
{"id": "1_dog_failed", "i_sentence": "John failed to adopt a dog. It follows him everywhere he goes.", "s_sentence": "John failed to adopt a dog. He doesn't have a big enough apartment.", "type": "failed"}
{"id": "2_car_affirmative", "i_sentence": "Lucy has a car and it has a self-driving mode.", "s_sentence": "Lucy has a car and she loves to go on roadtrips.", "type": "affirmative"}
{"id": "2_car_negated", "i_sentence": "Lucy doesn't have a car and it has a self-driving mode.", "s_sentence": "Lucy doesn't have a car and she only buys second-hand clothes.", "type": "negated"}
{"id": "2_car_know", "i_sentence": "I know that Lucy has a car. It has a self-driving mode.", "s_sentence": "I know that Lucy has a car. She loves to go on roadtrips.", "type": "know"}
{"id": "2_car_doubt", "i_sentence": "I doubt that Lucy has a car. It has a self-driving mode.", "s_sentence": "I doubt that Lucy has a car. She also only buys second-hand clothes.", "type": "doubt"}
{"id": "2_car_modal", "i_sentence": "Lucy wants to have a car and it has a self-driving mode.", "s_sentence": "Lucy wants to have a car and she also wants to get a motorcycle.", "type": "modal"}
{"id": "2_car_managed", "i_sentence": "Lucy managed to rent a car. It has a self-driving mode.", "s_sentence": "Lucy managed to rent a car. She found a place that was open late.", "type": "managed"}
{"id": "2_car_failed", "i_sentence": "Lucy failed to rent a car. It has a self-driving mode.", "s_sentence": "Lucy failed to rent a car. She couldn't find a place that was open late.", "type": "failed"}
{"id": "3_bear_affirmative", "i_sentence": "Carol saw a bear at the zoo and it was taller than she expected.", "s_sentence": "Carol saw a bear at the zoo and she took amazing pictures of it.", "type": "affirmative"}
{"id": "3_bear_negated", "i_sentence": "Carol didn't see a bear at the zoo and it was taller than she expected.", "s_sentence": "Carol didn't see a bear at the zoo and she went home disappointed.", "type": "negated"}
{"id": "3_bear_know", "i_sentence": "I know that Carol saw a bear at the zoo. It was taller than she expected.", "s_sentence": "I know that Carol saw a bear at the zoo. She took amazing pictures of it.", "type": "know"}
{"id": "3_bear_doubt", "i_sentence": "I doubt that Carol saw a bear at the zoo. It was taller than she expected.", "s_sentence": "I doubt that Carol saw a bear at the zoo. She didn't get to see any other big animals either.", "type": "doubt"}
{"id": "3_bear_modal", "i_sentence": "Carol wants to see a bear at the zoo and it is taller than she expected.", "s_sentence": "Carol wants to see a bear at the zoo and she does not stop talking about it.", "type": "modal"}
{"id": "3_bear_managed", "i_sentence": "Carol managed to see a bear at the zoo. It was taller than she expected.", "s_sentence": "Carol managed to see a bear at the zoo. She took amazing pictures of it.", "type": "managed"}
{"id": "3_bear_failed", "i_sentence": "Carol failed to see a bear at the zoo. It was taller than she expected.", "s_sentence": "Carol failed to see a bear at the zoo. She didn't get to see any other big animals either.", "type": "failed"}
{"id": "4_book_affirmative", "i_sentence": "Susan published a book and it is a real page-turner.", "s_sentence": "Susan published a book and she is going on tour later this year.", "type": "affirmative"}
{"id": "4_book_negated", "i_sentence": "Susan didn't publish a book and it is a real page-turner.", "s_sentence": "Susan didn't publish a book and she doesn't intend to do so in the near future.", "type": "negated"}
{"id": "4_book_know", "i_sentence": "I know that Susan published a book. It is a real page-turner.", "s_sentence": "I know that Susan published a book. She is going on tour later this year.", "type": "know"}
{"id": "4_book_doubt", "i_sentence": "I doubt that Susan published a book. It is a real page-turner.", "s_sentence": "I doubt that Susan published a book. She also hasn't written any good articles lately.", "type": "doubt"}
{"id": "4_book_modal", "i_sentence": "Susan wants to publish a book and it is a real page-turner.", "s_sentence": "Susan wants to publish a book and she committed to writing at least 2 pages a day.", "type": "modal"}
{"id": "4_book_managed", "i_sentence": "Susan managed to write a book. It is a real page-turner.", "s_sentence": "Susan managed to write a book. She is going on tour later this year.", "type": "managed"}
{"id": "4_book_failed", "i_sentence": "Susan failed to write a book. It is a real page-turner.", "s_sentence": "Susan failed to write a book. She also hasn't written any good articles lately.", "type": "failed"}
{"id": "5_shirt_affirmative", "i_sentence": "Mary found a shirt at the store and it looks amazing on her.", "s_sentence": "Mary found a shirt at the store and she wore it at the wedding.", "type": "affirmative"}
{"id": "5_shirt_negated", "i_sentence": "Mary didn't find a shirt at the store and it looks amazing on her.", "s_sentence": "Mary didn't find a shirt at the store and she had to wear a t-shirt instead.", "type": "negated"}
{"id": "5_shirt_know", "i_sentence": "I know that Mary found a shirt at the store. It looks amazing on her.", "s_sentence": "I know that Mary found a shirt at the store. She wore it at the wedding.", "type": "know"}
{"id": "5_shirt_doubt", "i_sentence": "I doubt that Mary found a shirt at the store. It looks amazing on her.", "s_sentence": "I doubt that Mary found a shirt at the store. She didn't manage to get any other nice clothes either.", "type": "doubt"}
{"id": "5_shirt_modal", "i_sentence": "Mary wants to find a shirt at the store and it looks amazing on her.", "s_sentence": "Mary wants to find a shirt at the store and she checked that the store is open on Sundays. ", "type": "modal"}
{"id": "5_shirt_managed", "i_sentence": "Mary managed to find a shirt at the store. It looks amazing on her.", "s_sentence": "Mary managed to find a shirt at the store. She wore it at the wedding.", "type": "managed"}
{"id": "5_shirt_failed", "i_sentence": "Mary failed to find a shirt at the store. It looks amazing on her.", "s_sentence": "Mary failed to find a shirt at the store. She didn't manage to get any other nice clothes either.", "type": "failed"}
{"id": "6_rat_affirmative", "i_sentence": "Carla got a pet rat and it is very noisy at night.", "s_sentence": "Carla got a pet rat and she constantly posts photos of it.", "type": "affirmative"}
{"id": "6_rat_negated", "i_sentence": "Carla didn't get a pet rat and it is very noisy at night.", "s_sentence": "Carla didn't get a pet rat and she is already regretting her decision.", "type": "negated"}
{"id": "6_rat_know", "i_sentence": "I know that Carla got a pet rat. It is very noisy at night.", "s_sentence": "I know that Carla got a pet rat. She constantly posts photos of it.", "type": "know"}
{"id": "6_rat_doubt", "i_sentence": "I doubt that Carla got a pet rat. It is very noisy at night.", "s_sentence": "I doubt that Carla got a pet rat. She wasn't particularly impressed by the chinchillas either.", "type": "doubt"}
{"id": "6_rat_modal", "i_sentence": "Carla wants to get a pet rat and it is very noisy at night.", "s_sentence": "Carla wants to get a pet rat and she already bought a cage.", "type": "modal"}
{"id": "6_rat_managed", "i_sentence": "Carla managed to get a pet rat. It is very noisy at night.", "s_sentence": "Carla managed to get a pet rat. She found one at the store at the mall.", "type": "managed"}
{"id": "6_rat_failed", "i_sentence": "Carla failed to get a pet rat. It is very noisy at night.", "s_sentence": "Carla failed to get a pet rat. She tried three different stores.", "type": "failed"}
{"id": "7_beer_affirmative", "i_sentence": "Sam ordered a beer at the bar and it was warm.", "s_sentence": "Sam ordered a beer at the bar and he gave a very generous tip.", "type": "affirmative"}
{"id": "7_beer_negated", "i_sentence": "Sam didn't order a beer at the bar and it was warm.", "s_sentence": "Sam didn't order a beer at the bar and he also didn't do any drugs.", "type": "negated"}
{"id": "7_beer_know", "i_sentence": "I know that Sam ordered a beer at the bar. It was warm.", "s_sentence": "I know that Sam ordered a beer at the bar. He gave a very generous tip.", "type": "know"}
{"id": "7_beer_doubt", "i_sentence": "I doubt that Sam ordered a beer at the bar. It was warm.", "s_sentence": "I doubt that Sam ordered a beer at the bar. He also couldn't get a drink with his fake ID anywhere else.", "type": "doubt"}
{"id": "7_beer_modal", "i_sentence": "Sam wants to order a beer at the bar and it is warm.", "s_sentence": "Sam wants to order a beer at the bar and he also wants to get some fries.", "type": "modal"}
{"id": "7_beer_managed", "i_sentence": "Sam managed to order a beer at the bar. It was warm.", "s_sentence": "Sam managed to order a beer at the bar. He had to stand in line for ten minutes though.", "type": "managed"}
{"id": "7_beer_failed", "i_sentence": "Sam failed to order a beer at the bar. It was warm.", "s_sentence": "Sam failed to order a beer at the bar. He also couldn't get a drink with his fake ID anywhere else.", "type": "failed"}
{"id": "8_cake_affirmative", "i_sentence": "Michael baked a cake and it was the best thing at the picnic.", "s_sentence": "Michael baked a cake and he also made a pie.", "type": "affirmative"}
{"id": "8_cake_negated", "i_sentence": "Michael didn't bake a cake and it was the best thing at the picnic.", "s_sentence": "Michael didn't bake a cake and he also didn't bring anything else to the picnic.", "type": "negated"}
{"id": "8_cake_know", "i_sentence": "I know that Michael baked a cake. It was the best thing at the picnic.", "s_sentence": "I know that Michael baked a cake. He also made a pie.", "type": "know"}
{"id": "8_cake_doubt", "i_sentence": "I doubt that Michael baked a cake. It was the best thing at the picnic.", "s_sentence": "I doubt that Michael baked a cake. He also didn't prepare anything else for the picnic.", "type": "doubt"}
{"id": "8_cake_modal", "i_sentence": "Michael wants to bake a cake and it is the best thing at the picnic.", "s_sentence": "Michael wants to bake a cake and he already chose a recipe.", "type": "modal"}
{"id": "8_cake_managed", "i_sentence": "Michael managed to bake a cake. It was the best thing at the picnic.", "s_sentence": "Michael managed to bake a cake. He also made a pie.", "type": "managed"}
{"id": "8_cake_failed", "i_sentence": "Michael failed to bake a cake. It was the best thing at the picnic.", "s_sentence": "Michael failed to bake a cake. He also didn't prepare anything else for the picnic.", "type": "failed"}
{"id": "9_letter_affirmative", "i_sentence": "Carolyn wrote a letter to her parents and it arrived three days after she sent it.", "s_sentence": "Carolyn wrote a letter to her parents and she also gave them a call.", "type": "affirmative"}
{"id": "9_letter_negated", "i_sentence": "Carolyn didn't write a letter to her parents and it arrived three days after she sent it.", "s_sentence": "Carolyn didn't write a letter to her parents and she also didn't explain anything when she visited them last year.", "type": "negated"}
{"id": "9_letter_know", "i_sentence": "I know that Carolyn wrote a letter to her parents. It arrived three days after she sent it.", "s_sentence": "I know that Carolyn wrote a letter to her parents. She also gave them a call.", "type": "know"}
{"id": "9_letter_doubt", "i_sentence": "I doubt that Carolyn wrote a letter to her parents. It arrived three days after she sent it.", "s_sentence": "I doubt that Carolyn wrote a letter to her parents. She also didn't give them a call.", "type": "doubt"}
{"id": "9_letter_modal", "i_sentence": "Carolyn wants to write a letter to her parents and it arrives three days after she sends it.", "s_sentence": "Carolyn wants to write a letter to her parents and she also plans to send them a gift.", "type": "modal"}
{"id": "9_letter_managed", "i_sentence": "Carolyn managed to write a letter to her parents. It arrived three days after she sent it.", "s_sentence": "Carolyn managed to write a letter to her parents. She also gave them a call.", "type": "managed"}
{"id": "9_letter_failed", "i_sentence": "Carolyn failed to write a letter to her parents. It arrived three days after she sent it.", "s_sentence": "Carolyn failed to write a letter to her parents. She also didn't give them a call.", "type": "failed"}
{"id": "10_hat_affirmative", "i_sentence": "Chris knitted a hat and it was very colorful.", "s_sentence": "Chris knitted a hat and he was very proud of it.", "type": "affirmative"}
{"id": "10_hat_negated", "i_sentence": "Chris didn't knit a hat and it was very colorful.", "s_sentence": "Chris didn't knit a hat and he didn't do any of the other assignments either.", "type": "negated"}
{"id": "10_hat_know", "i_sentence": "I know that Chris knitted a hat. It was very colorful.", "s_sentence": "I know that Chris knitted a hat. He was very proud of it.", "type": "know"}
{"id": "10_hat_doubt", "i_sentence": "I doubt that Chris knitted a hat. It was very colorful.", "s_sentence": "I doubt that Chris knitted a hat. He didn't do any of the other assignments either.", "type": "doubt"}
{"id": "10_hat_modal", "i_sentence": "Chris wants to knit a hat and it is very colorful.", "s_sentence": "Chris wants to knit a hat and he already chose the color for the yarn.", "type": "modal"}
{"id": "10_hat_managed", "i_sentence": "Chris managed to knit a hat. It was very colorful.", "s_sentence": "Chris managed to knit a hat. He was very proud of it.", "type": "managed"}
{"id": "10_hat_failed", "i_sentence": "Chris failed to knit a hat. It was very colorful.", "s_sentence": "Chris failed to knit a hat. He didn't do any of the other assignments either.", "type": "failed"}
{"id": "11_cod_affirmative", "i_sentence": "Sarah caught a cod and it made a fantastic dinner.", "s_sentence": "Sarah caught a cod and she ate it for dinner.", "type": "affirmative"}
{"id": "11_cod_negated", "i_sentence": "Sarah didn't catch a cod and it made a fantastic dinner.", "s_sentence": "Sarah didn't catch a cod and she got dinner from the store instead.", "type": "negated"}
{"id": "11_cod_know", "i_sentence": "I know that Sarah caught a cod. It made a fantastic dinner.", "s_sentence": "I know that Sarah caught a cod. She ate it for dinner.", "type": "know"}
{"id": "11_cod_doubt", "i_sentence": "I doubt that Sarah caught a cod. It made a fantastic dinner.", "s_sentence": "I doubt that Sarah caught a cod. She also didn't catch any shrimp.", "type": "doubt"}
{"id": "11_cod_modal", "i_sentence": "Sarah wants to catch a cod and it makes a fantastic dinner.", "s_sentence": "Sarah wants to catch a cod and she is obsessed with fishing blogs.", "type": "modal"}
{"id": "11_cod_managed", "i_sentence": "Sarah managed to catch a cod. It made a fantastic dinner.", "s_sentence": "Sarah managed to catch a cod. She ate it for dinner.", "type": "managed"}
{"id": "11_cod_failed", "i_sentence": "Sarah failed to catch a cod. It made a fantastic dinner.", "s_sentence": "Sarah failed to catch a cod. She also didn't catch any shrimp.", "type": "failed"}
{"id": "12_ticket_affirmative", "i_sentence": "Thomas booked a ticket in advance and it was much cheaper than he expected.", "s_sentence": "Thomas booked a ticket in advance and he also made a hotel reservation.", "type": "affirmative"}
{"id": "12_ticket_negated", "i_sentence": "Thomas didn't book a ticket in advance and it was much cheaper than he expected.", "s_sentence": "Thomas didn't book a ticket in advance and he couldn't get one at the airport.", "type": "negated"}
{"id": "12_ticket_know", "i_sentence": "I know that Thomas booked a ticket in advance. It was much cheaper than he expected.", "s_sentence": "I know that Thomas booked a ticket in advance. He also made a hotel reservation.", "type": "know"}
{"id": "12_ticket_doubt", "i_sentence": "I doubt that Thomas booked a ticket in advance. It was much cheaper than he expected.", "s_sentence": "I doubt that Thomas booked a ticket in advance. He didn't even show up at the airport until an hour before the flight.", "type": "doubt"}
{"id": "12_ticket_modal", "i_sentence": "Thomas wants to book a ticket in advance and it is much cheaper than he expected.", "s_sentence": "Thomas wants to book a ticket in advance and he started to look for cheap flights.", "type": "modal"}
{"id": "12_ticket_managed", "i_sentence": "Thomas managed to book a ticket. It was much cheaper than he expected.", "s_sentence": "Thomas managed to book a ticket. He also made a hotel reservation.", "type": "managed"}
{"id": "12_ticket_failed", "i_sentence": "Thomas failed to book a ticket. It was much cheaper than he expected.", "s_sentence": "Thomas failed to book a ticket. He also didn't show up at the airport until an hour before the flight.", "type": "failed"}
{"id": "13_bed_affirmative", "i_sentence": "Luke bought a bed and it was delivered the next day.", "s_sentence": "Luke bought a bed and he also got a new dresser.", "type": "affirmative"}
{"id": "13_bed_negated", "i_sentence": "Luke didn't buy a bed and it was delivered the next day.", "s_sentence": "Luke didn't buy a bed and he also refused to get a new dresser.", "type": "negated"}
{"id": "13_bed_know", "i_sentence": "I know that Luke bought a bed. It was delivered the next day.", "s_sentence": "I know that Luke bought a bed. He also got a new dresser.", "type": "know"}
{"id": "13_bed_doubt", "i_sentence": "I doubt that Luke bought a bed. It was delivered the next day.", "s_sentence": "I doubt that Luke bought a bed. He didn't get a mattress either.", "type": "doubt"}
{"id": "13_bed_modal", "i_sentence": "Luke wants to buy a bed and it is delivered the next day.", "s_sentence": "Luke wants to buy a bed and he also wants to get a dresser.", "type": "modal"}
{"id": "13_bed_managed", "i_sentence": "Luke managed to buy a bed. It was delivered the next day.", "s_sentence": "Luke managed to buy a bed. He also got a new dresser.", "type": "managed"}
{"id": "13_bed_failed", "i_sentence": "Luke failed to buy a bed. It was delivered the next day.", "s_sentence": "Luke failed to buy a bed. He didn't get a mattress either.", "type": "failed"}
{"id": "14_gin_affirmative", "i_sentence": "Dan drank a gin tonic and it was very strong.", "s_sentence": "Dan drank a gin tonic and he regretted it the next morning.", "type": "affirmative"}
{"id": "14_gin_negated", "i_sentence": "Dan didn't drink a gin tonic and it was very strong.", "s_sentence": "Dan didn't drink a gin tonic and he left before everyone else was drunk.", "type": "negated"}
{"id": "14_gin_know", "i_sentence": "I know that Dan drank a gin tonic. It was very strong.", "s_sentence": "I know that Dan drank a gin tonic. He regretted it in the morning.", "type": "know"}
{"id": "14_gin_doubt", "i_sentence": "I doubt that Dan drank a gin tonic. It was very strong.", "s_sentence": "I doubt that Dan drank a gin tonic. He didn't get any other drinks either.", "type": "doubt"}
{"id": "14_gin_modal", "i_sentence": "Dan wants to drink a gin tonic and it is very strong.", "s_sentence": "Dan wants to drink a gin tonic and he cannot wait for dry January to be over.", "type": "modal"}
{"id": "14_gin_managed", "i_sentence": "Dan managed to mix a gin tonic. It was very strong.", "s_sentence": "Dan managed to mix a gin tonic. He served it with a cucumber.", "type": "managed"}
{"id": "14_gin_failed", "i_sentence": "Dan failed to mix a gin tonic. It was very strong.", "s_sentence": "Dan failed to mix a gin tonic. He hadn't bought any tonic water.", "type": "failed"}
{"id": "15_bone_affirmative", "i_sentence": "David discovered a bone on his archeological expedition and it likely belonged to an extinct bird species.", "s_sentence": "David discovered a bone on his archeological expedition and he brought it back to the lab for an extensive analysis.", "type": "affirmative"}
{"id": "15_bone_negated", "i_sentence": "David didn't discover a bone on this archeological expedition and it likely belonged to an extinct bird species.", "s_sentence": "David didn't discover a bone on this archeological expedition and he also didn't find anything else worth analyzing.", "type": "negated"}
{"id": "15_bone_know", "i_sentence": "I know that David discovered a bone on his archeological expedition. It likely belonged to an extinct bird species.", "s_sentence": "I know that David discovered a bone on his archeological expedition. He brought it back to the lab for an extensive analysis.", "type": "know"}
{"id": "15_bone_doubt", "i_sentence": "I doubt that David discovered a bone on his archeological expedition. It likely belonged to an extinct bird species.", "s_sentence": "I doubt that David discovered a bone on his archeological expedition. He also didn't find anything else worth analyzing.", "type": "doubt"}
{"id": "15_bone_modal", "i_sentence": "David wants to discover a bone on his archeological expedition and it likely belongs to an extinct bird.", "s_sentence": "David wants to discover a bone on his archeological expedition and he is prepared to spend a long time at the excavation site.", "type": "modal"}
{"id": "15_bone_managed", "i_sentence": "David managed to discover a bone on his archeological expedition. It likely belonged to an extinct bird species.", "s_sentence": "David managed to discover a bone on his archeological expedition. He brought it back to the lab for an extensive analysis.", "type": "managed"}
{"id": "15_bone_failed", "i_sentence": "David failed to discover a bone on his archeological expedition. It likely belonged to an extinct bird species.", "s_sentence": "David failed to discover a bone on his archeological expedition. He also didn't find anything else worth analyzing.", "type": "failed"}
{"id": "16_house_affirmative", "i_sentence": "Lisa built a house and it is the most beautiful building I have ever seen.", "s_sentence": "Lisa built a house and she made sure that every room gets a lot of sunlight.", "type": "affirmative"}
{"id": "16_house_negated", "i_sentence": "Lisa didn't build a house and it is the most beautiful building I have ever seen.", "s_sentence": "Lisa didn't build a house and she lied about several other things as well.", "type": "negated"}
{"id": "16_house_know", "i_sentence": "I know that Lisa built a house. It is the most beautiful building I have ever seen.", "s_sentence": "I know that Lisa built a house. She made sure that every room gets a lot of sunlight.", "type": "know"}
{"id": "16_house_doubt", "i_sentence": "I doubt that Lisa built a house. It is the most beautiful building I have ever seen.", "s_sentence": "I doubt that Lisa built a house. She lied about several other things as well.", "type": "doubt"}
{"id": "16_house_modal", "i_sentence": "Lisa wants to build a house and it is the most beautiful building I have ever seen.", "s_sentence": "Lisa wants to build a house and she already bought a plot of land.", "type": "modal"}
{"id": "16_house_managed", "i_sentence": "Lisa managed to build a house. It is the most beautiful building I have ever seen.", "s_sentence": "Lisa managed to build a house. She made sure that every room gets a lot of sunlight.", "type": "managed"}
{"id": "16_house_failed", "i_sentence": "Lisa failed to build a house. It is the most beautiful building I have ever seen.", "s_sentence": "Lisa failed to build a house. She lied about several other things as well.", "type": "failed"}
