{"id": "1_dog_affirmative", "i_sentence": "John owns dogs and they follow him everywhere he goes.", "s_sentence": "John owns dogs and he is thinking about getting another one.", "type": "affirmative"}
{"id": "1_dog_negated", "i_sentence": "John doesn't own dogs and they follow him everywhere he goes.", "s_sentence": "John doesn't own dogs and he isn't planning on getting one.", "type": "negated"}
{"id": "1_dog_know", "i_sentence": "I know that John owns dogs. They follow him everywhere he goes.", "s_sentence": "I know that John owns dogs. He is thinking about getting another one.", "type": "know"}
{"id": "1_dog_doubt", "i_sentence": "I doubt that John owns dogs. They follow him everywhere he goes.", "s_sentence": "I doubt that John owns dogs. He doesn't own any other pets either.", "type": "doubt"}
{"id": "1_dog_modal", "i_sentence": "John wants to own dogs and they follow him everywhere he goes.", "s_sentence": "John wants to own dogs and he cannot wait to move to a building that allows pets.", "type": "modal"}
{"id": "1_dog_managed", "i_sentence": "John managed to adopt dogs. They follow him everywhere he goes.", "s_sentence": "John managed to adopt dogs. He only needed permission from his landlord.", "type": "managed"}
{"id": "1_dog_failed", "i_sentence": "John failed to adopt dogs. They follow him everywhere he goes.", "s_sentence": "John failed to adopt dogs. He doesn't have a big enough apartment.", "type": "failed"}
{"id": "2_car_affirmative", "i_sentence": "Lucy has cars and they have a self-driving mode.", "s_sentence": "Lucy has cars and she loves to go on roadtrips.", "type": "affirmative"}
{"id": "2_car_negated", "i_sentence": "Lucy doesn't have cars and they have a self-driving mode.", "s_sentence": "Lucy doesn't have cars and she only buys second-hand clothes.", "type": "negated"}
{"id": "2_car_know", "i_sentence": "I know that Lucy has cars. They have a self-driving mode.", "s_sentence": "I know that Lucy has cars. She loves to go on roadtrips.", "type": "know"}
{"id": "2_car_doubt", "i_sentence": "I doubt that Lucy has cars. They have a self-driving mode.", "s_sentence": "I doubt that Lucy has cars. She also only buys second-hand clothes.", "type": "doubt"}
{"id": "2_car_modal", "i_sentence": "Lucy wants to have cars and they have a self-driving mode.", "s_sentence": "Lucy wants to have cars and she also wants to get a motorcycle.", "type": "modal"}
{"id": "2_car_managed", "i_sentence": "Lucy managed to rent cars. They have a self-driving mode.", "s_sentence": "Lucy managed to rent cars. She found a place that was open late.", "type": "managed"}
{"id": "2_car_failed", "i_sentence": "Lucy failed to rent cars. They have a self-driving mode.", "s_sentence": "Lucy failed to rent cars. She couldn't find a place that was open late.", "type": "failed"}
{"id": "3_bear_affirmative", "i_sentence": "Carol saw bears at the zoo and they were taller than she expected.", "s_sentence": "Carol saw bears at the zoo and she took amazing pictures of them.", "type": "affirmative"}
{"id": "3_bear_negated", "i_sentence": "Carol didn't see bears at the zoo and they were taller than she expected.", "s_sentence": "Carol didn't see bears at the zoo and she went home disappointed.", "type": "negated"}
{"id": "3_bear_know", "i_sentence": "I know that Carol saw bears at the zoo. They were taller than she expected.", "s_sentence": "I know that Carol saw bears at the zoo. She took amazing pictures of them.", "type": "know"}
{"id": "3_bear_doubt", "i_sentence": "I doubt that Carol saw bears at the zoo. They were taller than she expected.", "s_sentence": "I doubt that Carol saw bears at the zoo. She didn't get to see any other big animals either.", "type": "doubt"}
{"id": "3_bear_modal", "i_sentence": "Carol wants to see bears at the zoo and they are taller than she expected.", "s_sentence": "Carol wants to see bears at the zoo and she does not stop talking about it.", "type": "modal"}
{"id": "3_bear_managed", "i_sentence": "Carol managed to see bears at the zoo. They were taller than she expected.", "s_sentence": "Carol managed to see bears at the zoo. She took amazing pictures of them.", "type": "managed"}
{"id": "3_bear_failed", "i_sentence": "Carol failed to see bears at the zoo. They were taller than she expected.", "s_sentence": "Carol failed to see bears at the zoo. She didn't get to see any other big animals either.", "type": "failed"}
{"id": "4_book_affirmative", "i_sentence": "Susan published books and they are real page-turners.", "s_sentence": "Susan published books and she is going on tour later this year.", "type": "affirmative"}
{"id": "4_book_negated", "i_sentence": "Susan didn't publish books and they are real page-turners.", "s_sentence": "Susan didn't publish books and she doesn't intend to so in the near future.", "type": "negated"}
{"id": "4_book_know", "i_sentence": "I know that Susan published books. They are real page-turners.", "s_sentence": "I know that Susan published books. She is going on tour later this year.", "type": "know"}
{"id": "4_book_doubt", "i_sentence": "I doubt that Susan published books. They are real page-turners.", "s_sentence": "I doubt that Susan published books. She also hasn't written any good articles lately.", "type": "doubt"}
{"id": "4_book_modal", "i_sentence": "Susan wants to publish books and they are a real page-turner.", "s_sentence": "Susan wants to publish books and she committed to writing at least 2 pages a day.", "type": "modal"}
{"id": "4_book_managed", "i_sentence": "Susan managed to write books. They are a real page-turner.", "s_sentence": "Susan managed to write books. She is going on tour later this year.", "type": "managed"}
{"id": "4_book_failed", "i_sentence": "Susan failed to write books. They are a real page-turner.", "s_sentence": "Susan failed to write books. She also hasn't written any good articles lately.", "type": "failed"}
{"id": "5_shirt_affirmative", "i_sentence": "Mary found shirts at the store and they look amazing on her.", "s_sentence": "Mary found shirts at the store and she wore one of them at the wedding.", "type": "affirmative"}
{"id": "5_shirt_negated", "i_sentence": "Mary didn't find shirts at the store and they look amazing on her.", "s_sentence": "Mary didn't find shirts at the store and she had to wear a t-shirt instead.", "type": "negated"}
{"id": "5_shirt_know", "i_sentence": "I know that Mary found shirts at the store. They look amazing on her.", "s_sentence": "I know that Mary found shirts at the store. She wore one of them at the wedding.", "type": "know"}
{"id": "5_shirt_doubt", "i_sentence": "I doubt that Mary found shirts at the store. They look amazing on her.", "s_sentence": "I doubt that Mary found shirts at the store. She didn't manage to get any other nice clothes either.", "type": "doubt"}
{"id": "5_shirt_modal", "i_sentence": "Mary wants to find shirts at the store and they look amazing on her.", "s_sentence": "Mary wants to find shirts at the store and she checked that the store is open on Sundays. ", "type": "modal"}
{"id": "5_shirt_managed", "i_sentence": "Mary managed to find shirts at the store. They look amazing on her.", "s_sentence": "Mary managed to find shirts at the store. She wore one of them at the wedding.", "type": "managed"}
{"id": "5_shirt_failed", "i_sentence": "Mary failed to find shirts at the store. They look amazing on her.", "s_sentence": "Mary failed to find shirts at the store. She didn't manage to get any other nice clothes either.", "type": "failed"}
{"id": "6_rat_affirmative", "i_sentence": "Carla got pet rats and they are very noisy at night.", "s_sentence": "Carla got pet rats and she constantly posts photos of them.", "type": "affirmative"}
{"id": "6_rat_negated", "i_sentence": "Carla didn't get pet rats and they are very noisy at night.", "s_sentence": "Carla didn't get pet rats and she is already regretting her decision.", "type": "negated"}
{"id": "6_rat_know", "i_sentence": "I know that Carla got pet rats. They are very noisy at night.", "s_sentence": "I know that Carla got pet rats. She constantly posts photos of them.", "type": "know"}
{"id": "6_rat_doubt", "i_sentence": "I doubt that Carla got pet rats. They are very noisy at night.", "s_sentence": "I doubt that Carla got pet rats. She wasn't particularly impressed by the chinchillas either.", "type": "doubt"}
{"id": "6_rat_modal", "i_sentence": "Carla wants to get pet rats and they are very noisy at night.", "s_sentence": "Carla wants to get pet rats and she already bought a cage.", "type": "modal"}
{"id": "6_rat_managed", "i_sentence": "Carla managed to get pet rats. They are very noisy at night.", "s_sentence": "Carla managed to get pet rats. She found them at the store at the mall.", "type": "managed"}
{"id": "6_rat_failed", "i_sentence": "Carla failed to get pet rats. They are very noisy at night.", "s_sentence": "Carla failed to get pet rats. She tried three different stores.", "type": "failed"}
{"id": "7_beer_affirmative", "i_sentence": "Sam ordered beers at the bar and they were warm.", "s_sentence": "Sam ordered beers at the bar and he gave a very generous tip.", "type": "affirmative"}
{"id": "7_beer_negated", "i_sentence": "Sam didn't order beers at the bar and they were warm.", "s_sentence": "Sam didn't order beers at the bar and he also didn't do any drugs.", "type": "negated"}
{"id": "7_beer_know", "i_sentence": "I know that Sam ordered beers at the bar. They were warm.", "s_sentence": "I know that Sam ordered beers at the bar. He gave a very generous tip.", "type": "know"}
{"id": "7_beer_doubt", "i_sentence": "I doubt that Sam ordered beers at the bar. They were warm.", "s_sentence": "I doubt that Sam ordered beers at the bar. He also couldn't drinks with his fake ID anywhere else.", "type": "doubt"}
{"id": "7_beer_modal", "i_sentence": "Sam wants to order beers at the bar and they are warm.", "s_sentence": "Sam wants to order beers at the bar and he also wants to get some fries.", "type": "modal"}
{"id": "7_beer_managed", "i_sentence": "Sam managed to order beers at the bar. They were warm.", "s_sentence": "Sam managed to order beers at the bar. He had to stand in line for ten minutes though.", "type": "managed"}
{"id": "7_beer_failed", "i_sentence": "Sam failed to order beers at the bar. They were warm.", "s_sentence": "Sam failed to order beers at the bar. He also couldn't get drinks with his fake ID anywhere else.", "type": "failed"}
{"id": "8_cake_affirmative", "i_sentence": "Michael baked cakes and they were the best thing at the picnic.", "s_sentence": "Michael baked cakes and he also made a pie.", "type": "affirmative"}
{"id": "8_cake_negated", "i_sentence": "Michael didn't bake cakes and they were the best thing at the picnic.", "s_sentence": "Michael didn't bake cakes and he also didn't bring anythinng else to the picnic.", "type": "negated"}
{"id": "8_cake_know", "i_sentence": "I know that Michael baked cakes. They were the best thing at the picnic.", "s_sentence": "I know that Michael baked cakes. He also made a pie.", "type": "know"}
{"id": "8_cake_doubt", "i_sentence": "I doubt that Michael baked cakes. They were the best thing at the picnic.", "s_sentence": "I doubt that Michael baked cakes. He also didn't prepare anything else for the picnic.", "type": "doubt"}
{"id": "8_cake_modal", "i_sentence": "Michael wants to bake cakes and they are the best thing at the picnic.", "s_sentence": "Michael wants to bake cakes and he already chose a recipe.", "type": "modal"}
{"id": "8_cake_managed", "i_sentence": "Michael managed to bake cakes. They were the best thing at the picnic.", "s_sentence": "Michael managed to bake cakes. He also made a pie.", "type": "managed"}
{"id": "8_cake_failed", "i_sentence": "Michael failed to bake cakes. They were the best thing at the picnic.", "s_sentence": "Michael failed to bake cakes. He also didn't prepare anything else for the picnic.", "type": "failed"}
{"id": "9_letter_affirmative", "i_sentence": "Carolyn wrote letters to her husband and they arrived three days after she sent them.", "s_sentence": "Carolyn wrote letters to her husband and she also gave him a call.", "type": "affirmative"}
{"id": "9_letter_negated", "i_sentence": "Carolyn didn't write letters to her husband and they arrived three days after she sent them.", "s_sentence": "Carolyn didn't write letters to her husband and she also didn't explain anything when she visitited them last year.", "type": "negated"}
{"id": "9_letter_know", "i_sentence": "I know that Carolyn wrote letters to her husband. They arrived three days after she sent them.", "s_sentence": "I know that Carolyn wrote letters to her husband. She also gave him a call.", "type": "know"}
{"id": "9_letter_doubt", "i_sentence": "I doubt that Carolyn wrote letters to her husband. They arrived three days after she sent them.", "s_sentence": "I doubt that Carolyn wrote letters to her husband. She also didn't give him a call.", "type": "doubt"}
{"id": "9_letter_modal", "i_sentence": "Carolyn wants to write letters to her parents and they arrive three days after she sends them.", "s_sentence": "Carolyn wants to write letters to her parents and she also plans to send them a gift.", "type": "modal"}
{"id": "9_letter_managed", "i_sentence": "Carolyn managed to write letters to her husband. They arrived three days after she sent it.", "s_sentence": "Carolyn managed to write letters to her husband. She also gave him a call.", "type": "managed"}
{"id": "9_letter_failed", "i_sentence": "Carolyn failed to write letters to her husband. They arrived three days after she sent it.", "s_sentence": "Carolyn failed to write letters to her husband. She also didn't give him a call.", "type": "failed"}
{"id": "10_hat_affirmative", "i_sentence": "Chris knitted hats and they were very colorful.", "s_sentence": "Chris knitted hats and he was very proud of them.", "type": "affirmative"}
{"id": "10_hat_negated", "i_sentence": "Chris didn't knit hats and they were very colorful.", "s_sentence": "Chris didn't knit hats and he didn't do any of the other assignments either.", "type": "negated"}
{"id": "10_hat_know", "i_sentence": "I know that Chris knitted hats. They were very colorful.", "s_sentence": "I know that Chris knitted hats. He was very proud of them.", "type": "know"}
{"id": "10_hat_doubt", "i_sentence": "I doubt that Chris knitted hats. They were very colorful.", "s_sentence": "I doubt that Chris knitted hats. He didn't do any of the other assignments either.", "type": "doubt"}
{"id": "10_hat_modal", "i_sentence": "Chris wants to knit hats and they are very colorful.", "s_sentence": "Chris wants to knit hats and he already chose the color for the yarn.", "type": "modal"}
{"id": "10_hat_managed", "i_sentence": "Chris managed to knit hats. They were very colorful.", "s_sentence": "Chris managed to knit hats. He was very proud of them.", "type": "managed"}
{"id": "10_hat_failed", "i_sentence": "Chris failed to knit hats. They were very colorful.", "s_sentence": "Chris failed to knit hats. He didn't do any of the other assignments either.", "type": "failed"}
{"id": "11_cod_affirmative", "i_sentence": "Sarah caught cods and they made a fantastic dinner.", "s_sentence": "Sarah caught cods and she ate them for dinner.", "type": "affirmative"}
{"id": "11_cod_negated", "i_sentence": "Sarah didn't catch cods and they made a fantastic dinner.", "s_sentence": "Sarah didn't catch cods and she got dinner from the store instead.", "type": "negated"}
{"id": "11_cod_know", "i_sentence": "I know that Sarah caught cods. They made a fantastic dinner.", "s_sentence": "I know that Sarah caught cods. She ate them for dinner.", "type": "know"}
{"id": "11_cod_doubt", "i_sentence": "I doubt that Sarah caught cods. They made a fantastic dinner.", "s_sentence": "I doubt that Sarah caught cods. She also didn't catch any shrimp.", "type": "doubt"}
{"id": "11_cod_modal", "i_sentence": "Sarah wants to catch cods and they make a fantastic dinner.", "s_sentence": "Sarah wants to catch cods and she is obsessed with fishing blogs.", "type": "modal"}
{"id": "11_cod_managed", "i_sentence": "Sarah managed to catch cods. They made a fantastic dinner.", "s_sentence": "Sarah managed to catch cods. She ate them for dinner.", "type": "managed"}
{"id": "11_cod_failed", "i_sentence": "Sarah failed to catch cods. They made a fantastic dinner.", "s_sentence": "Sarah failed to catch cods. She also didn't catch any shrimp.", "type": "failed"}
{"id": "12_ticket_affirmative", "i_sentence": "Thomas booked tickets in advance and they were much cheaper than he expected.", "s_sentence": "Thomas booked tickets in advance and he also made a hotel reservation.", "type": "affirmative"}
{"id": "12_ticket_negated", "i_sentence": "Thomas didn't book tickets in advance and they were much cheaper than he expected.", "s_sentence": "Thomas didn't book tickets in advance and he couldn't get any at the airport.", "type": "negated"}
{"id": "12_ticket_know", "i_sentence": "I know that Thomas booked tickets in advance. They were much cheaper than he expected.", "s_sentence": "I know that Thomas booked tickets in advance. He also made a hotel reservation.", "type": "know"}
{"id": "12_ticket_doubt", "i_sentence": "I doubt that Thomas booked tickets in advance. They were much cheaper than he expected.", "s_sentence": "I doubt that Thomas booked tickets in advance. He didn't even show up at the airport until an hour before the flight.", "type": "doubt"}
{"id": "12_ticket_modal", "i_sentence": "Thomas wants to book tickets in advance and they are much cheaper than he expected.", "s_sentence": "Thomas wants to book tickets in advance and he started to look for cheap flights.", "type": "modal"}
{"id": "12_ticket_managed", "i_sentence": "Thomas managed to book tickets. They were much cheaper than he expected.", "s_sentence": "Thomas managed to book tickets. He also made a hotel reservation.", "type": "managed"}
{"id": "12_ticket_failed", "i_sentence": "Thomas failed to book tickets. They were much cheaper than he expected.", "s_sentence": "Thomas failed to book tickets. He also didn't show up at the airport until an hour before the flight.", "type": "failed"}
{"id": "13_bed_affirmative", "i_sentence": "Luke bought beds and they were delivered the next day.", "s_sentence": "Luke bought beds and he also got a new dresser.", "type": "affirmative"}
{"id": "13_bed_negated", "i_sentence": "Luke didn't buy beds and they were delivered the next day.", "s_sentence": "Luke didn't buy beds and he also refused to get a new dresser.", "type": "negated"}
{"id": "13_bed_know", "i_sentence": "I know that Luke bought beds. They were delivered the next day.", "s_sentence": "I know that Luke bought beds. He also got a new dresser.", "type": "know"}
{"id": "13_bed_doubt", "i_sentence": "I doubt that Luke bought beds. They were delivered the next day.", "s_sentence": "I doubt that Luke bought beds. He didn't get a mattress either.", "type": "doubt"}
{"id": "13_bed_modal", "i_sentence": "Luke wants to buy beds and they are delivered the next day.", "s_sentence": "Luke wants to buy beds and he also wants to get a dresser.", "type": "modal"}
{"id": "13_bed_managed", "i_sentence": "Luke managed to buy beds. They were delivered the next day.", "s_sentence": "Luke managed to buy beds. He also got a new dresser.", "type": "managed"}
{"id": "13_bed_failed", "i_sentence": "Luke failed to buy beds. They were delivered the next day.", "s_sentence": "Luke failed to buy beds. He didn't get a mattress either.", "type": "failed"}
{"id": "14_gin_affirmative", "i_sentence": "Dan drank gin tonics and they were very strong.", "s_sentence": "Dan drank gin tonics and he regretted it the next morning.", "type": "affirmative"}
{"id": "14_gin_negated", "i_sentence": "Dan didn't drink gin tonics and they were very strong.", "s_sentence": "Dan didn't drink gin tonics and he left before everyone else was drunk.", "type": "negated"}
{"id": "14_gin_know", "i_sentence": "I know that Dan drank gin tonics. They were very strong.", "s_sentence": "I know that Dan drank gin tonics. He regretted it in the morning.", "type": "know"}
{"id": "14_gin_doubt", "i_sentence": "I doubt that Dan drank gin tonics. They were very strong.", "s_sentence": "I doubt that Dan drank gin tonics. He didn't get any other drinks either.", "type": "doubt"}
{"id": "14_gin_modal", "i_sentence": "Dan wants to drink gin tonics and they are very strong.", "s_sentence": "Dan wants to drink gin tonics and he cannot wait for dry January to be over.", "type": "modal"}
{"id": "14_gin_managed", "i_sentence": "Dan managed to mix gin tonics. They were very strong.", "s_sentence": "Dan managed to mix gin tonics. He served them with cucumbers.", "type": "managed"}
{"id": "14_gin_failed", "i_sentence": "Dan failed to mix gin tonics. They were very strong.", "s_sentence": "Dan failed to mix gin tonics. He hadn't bough any tonic water.", "type": "failed"}
{"id": "15_bone_affirmative", "i_sentence": "David discovered bones on his archeological expedition and they likely belonged to an extinct bird species.", "s_sentence": "David discovered bones on his archeological expedition and he brought them back to the lab for an extensive analysis.", "type": "affirmative"}
{"id": "15_bone_negated", "i_sentence": "David didn't discover bones on his archeological expedition and they likely belonged to an extinct bird species.", "s_sentence": "David didn't discover bones on his archeological expedition and he also didn't find anything else worth analyzing.", "type": "negated"}
{"id": "15_bone_know", "i_sentence": "I know that David discovered bones on his archeological expedition. They likely belonged to an extinct bird species.", "s_sentence": "I know that David discovered bones on his archeological expedition. He brought them back to the lab for an extensive analysis.", "type": "know"}
{"id": "15_bone_doubt", "i_sentence": "I doubt that David discovered bones on his archeological expedition. They likely belonged to an extinct bird species.", "s_sentence": "I doubt that David discovered bones on his archeological expedition. He also didn't find anything else worth analyzing.", "type": "doubt"}
{"id": "15_bone_modal", "i_sentence": "David wants to discover bones on his archeological expedition and they likely belong to an extinct bird.", "s_sentence": "David wants to discover bones on his archeological expedition and he is prepared to spend a long time at the excavation site.", "type": "modal"}
{"id": "15_bone_managed", "i_sentence": "David managed to discover bones on his archeological expedition. They likely belonged to an extinct bird species.", "s_sentence": "David managed to discover bones on his archeological expedition. He brought them back to the lab for an extensive analysis.", "type": "managed"}
{"id": "15_bone_failed", "i_sentence": "David failed to discover bones on his archeological expedition. They likely belonged to an extinct bird species.", "s_sentence": "David failed to discover bones on his archeological expedition. He also didn't find anything else worth analyzing.", "type": "failed"}
{"id": "16_house_affirmative", "i_sentence": "Lisa built houses and they are the most beautiful buildings I have ever seen.", "s_sentence": "Lisa built houses and she made sure that every room gets a lot of sunlight.", "type": "affirmative"}
{"id": "16_house_negated", "i_sentence": "Lisa didn't build houses and they are the most beautiful buildings I have ever seen.", "s_sentence": "Lisa didn't build houses and she lied about several other things as well.", "type": "negated"}
{"id": "16_house_know", "i_sentence": "I know that Lisa built houses. They are the most beautiful buildings I have ever seen.", "s_sentence": "I know that Lisa built houses. She made sure that every room gets a lot of sunlight.", "type": "know"}
{"id": "16_house_doubt", "i_sentence": "I doubt that Lisa built houses. They are the most beautiful buildings I have ever seen.", "s_sentence": "I doubt that Lisa built houses. She lied about several other things as well.", "type": "doubt"}
{"id": "16_house_modal", "i_sentence": "Lisa wants to build houses and they are the most beautiful buildings I have ever seen.", "s_sentence": "Lisa wants to build houses and she already bought several plots of land.", "type": "modal"}
{"id": "16_house_managed", "i_sentence": "Lisa managed to build houses. They are most beautiful buildings I have ever seen.", "s_sentence": "Lisa managed to build houses. She made sure that every room gets a lot of sunlight.", "type": "managed"}
{"id": "16_house_failed", "i_sentence": "Lisa failed to build houses. They are most beautiful buildings I have ever seen.", "s_sentence": "Lisa failed to build houses. She lied about several other things as well.", "type": "failed"}
